[
  {
    "id": "ai_1764498876982_0",
    "subjectId": "tur",
    "topic": "Anlatım Teknikleri",
    "questionText": "Yolun kenarında, zamana yenik düşmüş iki katlı ahşap ev, yorgun bir bilge gibi suskunluğa bürünmüştü. Kırık pencereleri, hayata küsmüş gözler misali boşluğa bakıyordu. Çatısındaki yosunlar, onun yaşanmışlıklarla dolu saçları gibiydi. Rüzgâr, kırık panjurlarına her çarptığında sanki eski anıları hüzünlü bir şarkı gibi fısıldıyordu.",
    "options": [
      "Öyküleme - Karşılaştırma",
      "Açıklama - Tanımlama",
      "Betimleme - Kişileştirme",
      "Tartışma - Örnekleme",
      "Tanık Gösterme - Benzetme"
    ],
    "correctAnswer": 2,
    "explanation": "Parçada, okuyucunun zihninde bir sahne canlandırılmak istendiği için “betimleme” ağır basmaktadır. Ahşap evin “yorgun bir bilge” gibi olması, pencerelerinin “hayata küsmüş gözler” gibi bakması ve rüzgârın “anıları fısıldaması” gibi ifadelerle cansız varlıklara insani özellikler yüklendiği için “kişileştirme” sanatına başvurulmuştur. Bu iki anlatım tekniği metnin bütününe hâkimdir.",
    "difficulty": 3
  },
  {
    "id": "ai_1764498876982_1",
    "subjectId": "tur",
    "topic": "Anlatım Teknikleri",
    "questionText": "Dijital kitapların pratikliği ve kolay erişilebilirliği sıkça övülür. Binlerce kitabı küçücük bir cihazda taşıma fikri şüphesiz cezbedici. Ancak bu durum, kâğıdın o eşsiz dokusunu, mürekkep kokusunu ve sayfa çevirmenin o tanıdık hissini göz ardı etmektir. Asıl okuma deneyimi, fiziksel bir bağ kurduğumuz kitapla mümkündür. Dijital ekranların yaydığı mavi ışığın göz yorgunluğuna yol açtığı da biliniyor. Bu yüzden teknoloji ne kadar ilerlerse ilerlesin, gerçek kitapseverler için basılı kitabın yeri doldurulamaz.",
    "options": [
      "Tartışmacı anlatım tekniği kullanılmıştır.",
      "Farklı durumlar arasında karşılaştırma yapılmıştır.",
      "Yazar, düşüncelerini kanıtlama amacı gütmüştür.",
      "Okuyucuya bilgi vermek amacıyla nesnel bir dil kullanılmıştır.",
      "Metnin genelinde öznel yargılara yer verilmiştir."
    ],
    "correctAnswer": 3,
    "explanation": "Parçada yazar, dijital kitap ve basılı kitap konusundaki iki farklı görüşü ele alıp kendi tezini (basılı kitabın üstünlüğünü) savunmaktadır. Bu durum “tartışmacı anlatım” olduğunu gösterir (A seçeneği doğrudur). Dijital ve basılı kitaplar çeşitli yönleriyle kıyaslandığı için “karşılaştırma” yapılmıştır (B seçeneği doğrudur). Yazar, “Asıl okuma deneyimi...”, “yeri doldurulamaz” gibi ifadelerle kendi görüşünü savunduğu için metin “öznel” bir nitelik taşır (E seçeneği doğrudur) ve okuyucuyu ikna etmeye çalıştığı için “kanıtlama amacı” güder (C seçeneği doğrudur). Ancak yazar, nesnel bir dille sadece bilgi vermeyi değil, kendi öznel görüşünü kabul ettirmeyi amaçladığı için D seçeneğindeki ifade yanlıştır.",
    "difficulty": 3
  }
]