[
  {
    "id": "ai_1764500245934_0",
    "subjectId": "tur",
    "topic": "Anlatım Teknikleri",
    "questionText": "Kapıyı yavaşça araladı. Odanın ortasında, ceviz ağacından yapılmış masanın üzerinde antika bir gaz lambası duruyordu. Lambanın titrek ışığı, duvardaki solgun portrelere vuruyor, zamanın yüzlerde açtığı derin çizgileri daha da belirginleştiriyordu. Adam, parke zeminde hiç ses çıkarmadan masaya doğru ilerledi, parmak uçlarıyla lambanın soğuk camına dokundu. Bu odanın havasında yılların birikmiş hüznü ve anıları saklı gibiydi.",
    "options": [
      "Öyküleme",
      "Açıklama",
      "Betimleme",
      "Tartışma",
      "Karşılaştırma"
    ],
    "correctAnswer": 2,
    "explanation": "Paragrafta bir olay akışı (kapıyı aralamak, ilerlemek, dokunmak) olsa da yazarın asıl amacı, okuyucunun zihninde bir sahne canlandırmaktır. Odanın, masanın, lambanın ve portrelerin görsel özelliklerini ayrıntılarıyla vererek bir atmosfer oluşturmaya odaklanılmıştır. Varlıklar ve mekan, ayırt edici nitelikleriyle anlatıldığı için ağır basan anlatım tekniği betimlemedir. Öyküleme, betimlemeye hizmet eden bir araç olarak kullanılmıştır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764500245934_1",
    "subjectId": "tur",
    "topic": "Anlatım Teknikleri",
    "questionText": "Ali, masasında oturmuş, önündeki boş kağıda bakıyordu. Son teslim tarihi yarındı ama aklına tek bir kelime bile gelmiyordu. Bu projenin kariyeri için ne kadar önemli olduğunu biliyordu ve bu bilgi omuzlarına ağır bir yük bindiriyordu. Başarısız olma düşüncesi zihnini bir zehir gibi sarmıştı. Yıllardır kurduğu hayallerin bir anda yıkılmasından ölesiye korkuyor, içindeki sesin 'Yapamayacaksın!' diye bağırdığını duyuyordu sanki. Bu korku, mantıklı düşünme yetisini neredeyse tamamen elinden almıştı.",
    "options": [
      "Bilinç akışı",
      "İç konuşma (iç monolog)",
      "Geriye dönüş",
      "İç çözümleme",
      "Diyalog"
    ],
    "correctAnswer": 3,
    "explanation": "Bu paragrafta, anlatıcı üçüncü kişidir (O anlatıcı). Anlatıcı, kahraman Ali'nin zihninin içine girerek onun düşüncelerini, korkularını ve ruhsal durumunu okuyucuya aktarmaktadır. Ali'nin düşünceleri, 'Ben korkuyorum, yapamayacağım.' gibi doğrudan kendi ağzından değil, anlatıcının süzgecinden geçirilerek '...ölesiye korkuyor, ...elinden almıştı.' gibi ifadelerle anlatılmıştır. Kahramanın iç dünyasının, psikolojisinin anlatıcı tarafından tahlil edilerek sunulması tekniğine 'iç çözümleme' denir. Eğer bu düşünceler, araya anlatıcı girmeden, birinci tekil şahıs ağzından aktarılsaydı 'iç konuşma' olurdu.",
    "difficulty": 3
  }
]