[
  {
    "id": "ai_1764500415115_0",
    "subjectId": "tur",
    "topic": "Anlam İlişkileri",
    "questionText": "Aşağıdaki cümlelerin hangisinde yargılar arasında diğerlerinden farklı bir anlam ilişkisi vardır?",
    "options": [
      "Yollar buzlandığı için trafik akışı yavaşladı.",
      "İyi bir üniversite kazanmak amacıyla gece gündüz ders çalışıyordu.",
      "Annesini çok özlediğinden ilk uçakla memleketine gitti.",
      "Uykusunu alamadığından gün boyu kendini yorgun hissetti.",
      "Gürültüden rahatsız olunca pencereyi kapattı."
    ],
    "correctAnswer": 1,
    "explanation": "Bu soruda cümlelerdeki anlam ilişkileri incelenmelidir. A, C, D ve E şıklarında neden-sonuç (sebep-sonuç) ilişkisi varken, B şıkkında amaç-sonuç ilişkisi vardır. Neden-sonuç cümlelerinde eylemin gerçekleşme nedeni belirtilirken ('Neden yavaşladı?' -> 'Yollar buzlandığı için'), amaç-sonuç cümlelerinde eylemin hangi hedefle yapıldığı belirtilir ('Hangi amaçla ders çalışıyordu?' -> 'İyi bir üniversite kazanmak amacıyla'). B seçeneğindeki 'kazanmak' eylemi henüz gerçekleşmemiş bir hedeftir, bu da cümleyi diğerlerinden ayırır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764500415115_1",
    "subjectId": "tur",
    "topic": "Anlam İlişkileri",
    "questionText": "Aşağıdaki cümlelerin hangisinde bir eylemin gerçekleşmesi başka bir durumun gerçekleşmesine bağlıdır?",
    "options": [
      "Yoğun kar yağışı yüzünden okullar tatil edildi.",
      "Hava kararmadan eve dönmüş olmalıyız.",
      "İstediğin bölümü kazanman, düzenli çalışmana bağlı.",
      "Yazar, son romanında toplumsal sorunlara değinmiş.",
      "Toplantı salonuna girdiğinde herkes onu bekliyordu."
    ],
    "correctAnswer": 2,
    "explanation": "Bu soruda koşul-sonuç (şart-sonuç) ilişkisi içeren cümle sorulmaktadır. Koşul-sonuç cümlelerinde bir eylemin veya durumun gerçekleşmesi, başka bir eylemin veya durumun gerçekleşmesi şartına bağlanır. C seçeneğinde 'istediğin bölümü kazanman' sonucu, 'düzenli çalışman' koşuluna bağlanmıştır. Diğer seçeneklerde ise bu tür bir koşul ilişkisi yoktur. A'da neden-sonuç, B'de gereklilik, D'de içerik belirtme, E'de ise zaman ilişkisi bulunmaktadır.",
    "difficulty": 3
  }
]