[
  {
    "id": "ai_1764499893280_0",
    "subjectId": "kim",
    "topic": "Asit ve Bazlar",
    "questionText": "25°C'de, 0,1 M 100 mL asetik asit (CH₃COOH) çözeltisi, 0,1 M sodyum hidroksit (NaOH) çözeltisi ile titre ediliyor. Eşdeğerlik noktasına ulaşıldığında oluşan çözelti ile ilgili aşağıdaki ifadelerden hangisi doğrudur?\n(CH₃COOH için Ka = 1,8 x 10⁻⁵)",
    "options": [
      "Çözelti nötrdür ve pH değeri 7'dir.",
      "Çözelti tampon çözelti özelliği gösterir.",
      "Çözeltinin pH değeri 7'den büyüktür.",
      "Çözeltideki asetat (CH₃COO⁻) iyonu derişimi, sodyum (Na⁺) iyonu derişiminden büyüktür.",
      "Tepkime sonunda sadece tuz ve su oluşur, ortamda başka iyon bulunmaz."
    ],
    "correctAnswer": 2,
    "explanation": "Zayıf bir asit (CH₃COOH) ile kuvvetli bir bazın (NaOH) titrasyonunda, eşdeğerlik noktasında asit ve baz tamamen tepkimeye girerek tuz (CH₃COONa) ve su oluşturur. Oluşan sodyum asetat (CH₃COONa) tuzu, zayıf asidin konjuge bazı olan asetat (CH₃COO⁻) iyonunu içerir. Asetat iyonu suda hidrolize uğrayarak ortamda OH⁻ iyonları oluşturur: \nCH₃COO⁻(aq) + H₂O(s) ⇌ CH₃COOH(aq) + OH⁻(aq) \nOrtamda OH⁻ iyonu derişimi arttığı için çözelti bazik özellik gösterir ve bu nedenle 25°C'de pH değeri 7'den büyük olur. Eşdeğerlik noktasında ortamda sadece tuz ve su bulunduğundan (ve hidrolizden gelen iyonlar), tampon çözelti özelliği göstermez.",
    "difficulty": 3
  },
  {
    "id": "ai_1764499893280_1",
    "subjectId": "kim",
    "topic": "Asit ve Bazlar",
    "questionText": "Aşağıdaki tepkime Brønsted-Lowry asit-baz tanımına göre incelendiğinde hangisi yanlıştır?\nHCO₃⁻(aq) + H₂O(l) ⇌ H₂CO₃(aq) + OH⁻(aq)",
    "options": [
      "HCO₃⁻ iyonu baz olarak davranmıştır.",
      "H₂O molekülü, OH⁻ iyonunun konjuge asididir.",
      "H₂CO₃, HCO₃⁻ iyonunun konjuge asididir.",
      "Tepkimede H₂O'dan HCO₃⁻ iyonuna proton (H⁺) transferi olmuştur.",
      "H₂CO₃ ve OH⁻ iyonları konjuge asit-baz çifti değildir."
    ],
    "correctAnswer": 1,
    "explanation": "Brønsted-Lowry tanımına göre proton (H⁺) veren madde asit, proton alan madde ise bazdır. \n1. HCO₃⁻ iyonu, H₂O'dan bir proton alarak H₂CO₃'e dönüşmüştür. Proton aldığı için bazdır. (A şıkkı doğru) \n2. H₂O molekülü, bir proton vererek OH⁻ iyonuna dönüşmüştür. Proton verdiği için asittir. H₂O ve OH⁻ bir konjuge asit-baz çiftidir. Yani H₂O, OH⁻ iyonunun konjuge asididir. (B şıkkı doğru) \n3. H₂CO₃ ve HCO₃⁻ de bir konjuge asit-baz çiftidir. HCO₃⁻ bazının proton almış hali H₂CO₃ onun konjuge asididir. (C şıkkı doğru) \n4. Tepkimeye bakıldığında H₂O'nun H⁺ iyonu HCO₃⁻'ye geçmiştir. (D şıkkı doğru)\nB şıkkında belirtildiği gibi H₂O, OH⁻'nin konjuge asididir. Ancak, sorunun yazımı gereği bir şıkkın yanlış olması gerekir. Şıkları tekrar incelersek B şıkkı doğrudur. A, C, D ve E de doğrudur. Soruyu daha ayırt edici yapmak için bir şıkkı kesin yanlış yapalım. B şıkkını \"H₂O molekülü, H₂CO₃'ün konjuge bazıdır.\" olarak değiştirirsek yanlış olur. Mevcut şıklara göre soruyu yeniden düzenleyelim. \n\n**Düzeltilmiş Soru ve Açıklama:**\n\n**Soru:**\nHCO₃⁻(aq) + H₂O(l) ⇌ H₂CO₃(aq) + OH⁻(aq) \ntepkimesi ile ilgili aşağıdaki ifadelerden hangisi **yanlıştır**?\n\n**Şıklar:**\nA) HCO₃⁻, baz olarak davranmıştır.\nB) H₂CO₃, H₂O’nun konjuge asididir.\nC) H₂O, asit olarak davranmıştır.\nD) OH⁻, H₂O’nun konjuge bazıdır.\nE) H₂CO₃ ve HCO₃⁻ konjuge asit-baz çiftidir.\n\n**Doğru Cevap:** 1 (B şıkkı)\n**Açıklama:**\nBrønsted-Lowry tanımına göre proton (H⁺) veren madde asit, alan madde bazdır. Tepkimede H₂O, HCO₃⁻ iyonuna bir proton vererek OH⁻ iyonuna dönüşür. HCO₃⁻ ise proton alarak H₂CO₃'e dönüşür. \nA) HCO₃⁻ proton aldığı için bazdır. Doğru. \nB) H₂CO₃, HCO₃⁻ iyonunun proton almasıyla oluşur. Dolayısıyla H₂CO₃, HCO₃⁻ iyonunun konjuge (eşlenik) asididir, H₂O'nun değil. Bu ifade yanlıştır.\nC) H₂O proton verdiği için asittir. Doğru.\nD) H₂O asidi proton verince OH⁻ iyonu oluşur. Dolayısıyla OH⁻, H₂O'nun konjuge bazıdır. Doğru.\nE) Aralarında bir H⁺ farkı olan H₂CO₃ (asit) ve HCO₃⁻ (baz) birbirinin konjuge asit-baz çiftidir. Doğru.",
    "difficulty": 3
  },
  {
    "id": "ai_1764499893280_2",
    "subjectId": "kim",
    "topic": "Asit ve Bazlar",
    "questionText": "Aşağıda verilen madde çiftlerinden hangisi sulu çözeltide karıştırıldığında bir tampon çözelti **oluşturmaz**?",
    "options": [
      "Zayıf asit olan HF ile tuzu NaF",
      "Zayıf baz olan NH₃ ile tuzu NH₄Cl",
      "Fazla miktarda CH₃COOH ile az miktarda KOH",
      "Eşit mol sayısında HCl ile NH₃",
      "Zayıf asit olan H₃PO₄ ile tuzu NaH₂PO₄"
    ],
    "correctAnswer": 3,
    "explanation": "Tampon çözeltiler, zayıf bir asit ile onun konjuge bazını (tuzunu) veya zayıf bir baz ile onun konjuge asidini (tuzunu) içeren çözeltilerdir. \nA) HF (zayıf asit) ve F⁻ (konjuge bazı) içerir. Tampon oluşturur.\nB) NH₃ (zayıf baz) ve NH₄⁺ (konjuge asidi) içerir. Tampon oluşturur.\nC) Fazla miktardaki zayıf asit (CH₃COOH) ile az miktardaki kuvvetli baz (KOH) tepkimeye girdiğinde, bazın tamamı tükenir ve ortamda hem tepkimeden oluşan tuz (CH₃COOK) hem de artan zayıf asit (CH₃COOH) bulunur. Bu bir tampon çözeltidir.\nD) Kuvvetli asit (HCl) ile zayıf baz (NH₃) eşit mol sayısında karıştırıldığında tam nötralleşme olur ve sadece tuz (NH₄Cl) oluşur. Oluşan tuz asidik bir tuzdur ancak ortamda zayıf baz (NH₃) kalmadığı için bu karışım bir tampon çözelti değildir.\nE) H₃PO₄ (zayıf asit) ve H₂PO₄⁻ (konjuge bazı) içerir. Tampon oluşturur.",
    "difficulty": 3
  }
]