[
  {
    "id": "ai_1764499825851_0",
    "subjectId": "kim",
    "topic": "Atom ve Periyodik Sistem",
    "questionText": "Baş grup elementi olan X'in ilk dört iyonlaşma enerjisi (İE) kJ/mol cinsinden aşağıda verilmiştir:\n\nİE₁: 738\nİE₂: 1451\nİE₃: 7733\nİE₄: 10540\n\nBu bilgilere göre X elementi ile ilgili aşağıdaki ifadelerden hangisi doğrudur?",
    "options": [
      "Değerlik elektron sayısı 3'tür.",
      "Periyodik sistemin 13. grubunda yer alır.",
      "Oksijen ile oluşturduğu bileşiğin formülü XO'dur.",
      "Atom numarası 11 olabilir.",
      "Bir halojendir."
    ],
    "correctAnswer": 2,
    "explanation": "Bir elementin ardışık iyonlaşma enerjileri incelendiğinde, genellikle 3,5-4 katından daha büyük olan ani bir artış, elektronun bir iç katmandan (soygaz düzeninden) koptuğunu gösterir. Tablodaki değerlere bakıldığında, ikinci (İE₂) ve üçüncü (İE₃) iyonlaşma enerjileri arasında yaklaşık 5,3 katlık (7733 / 1451 ≈ 5,3) büyük bir artış görülmektedir. Bu durum, X elementinin 2 adet değerlik elektronu olduğunu ve bu iki elektronu verdikten sonra soygaz elektron düzenine ulaştığını gösterir. Dolayısıyla X elementi, periyodik sistemin 2A grubunda (2. grup) yer alan bir toprak alkali metalidir.\n\nŞıkları inceleyelim:\nA) Değerlik elektron sayısı 2'dir. Bu ifade yanlıştır.\nB) Periyodik sistemin 2A grubunda, yani 2. grubunda yer alır. Bu ifade yanlıştır.\nC) 2A grubundaki elementler bileşiklerinde +2 değerlik alırlar. Oksijen ise -2 değerlik alır. Bu ikisi arasında iyonik bağ ile oluşacak bileşiğin formülü çaprazlama kuralına göre X₂O₂ olur ve en sade haliyle XO şeklinde yazılır. Bu ifade doğrudur.\nD) Atom numarası 11 olan element sodyumdur (Na) ve 1A grubunda yer alır. X elementi 2A grubunda olduğundan bu ifade yanlıştır.\nE) Halojenler 7A grubunda yer alır. Bu ifade yanlıştır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764499825851_1",
    "subjectId": "kim",
    "topic": "Atom ve Periyodik Sistem",
    "questionText": "³⁹₁₉K⁺, ⁴⁰₁₈Ar ve ⁴⁰₂₀Ca²⁺ tanecikleri ile ilgili aşağıdaki ifadelerden hangisi yanlıştır?",
    "options": [
      "K⁺ ve Ar taneciklerinin elektron sayıları eşittir.",
      "Ar ve Ca²⁺ tanecikleri izobardır.",
      "K⁺ ve Ca²⁺ taneciklerinin nötron sayıları farklıdır.",
      "Tanecik yarıçapı en büyük olan Ar'dir.",
      "Üç tanecik de birbiriyle izoelektroniktir."
    ],
    "correctAnswer": 3,
    "explanation": "Öncelikle taneciklerin proton (p), nötron (n) ve elektron (e) sayılarını bulalım:\n\n1. ³⁹₁₉K⁺:\n   p = 19\n   n = Kütle No - Proton No = 39 - 19 = 20\n   e = Proton No - Yük = 19 - (+1) = 18\n\n2. ⁴⁰₁₈Ar:\n   p = 18\n   n = 40 - 18 = 22\n   e = 18 (nötr atom)\n\n3. ⁴⁰₂₀Ca²⁺:\n   p = 20\n   n = 40 - 20 = 20\n   e = 20 - (+2) = 18\n\nŞimdi şıkları değerlendirelim:\nA) K⁺ taneciğinin 18 elektronu, Ar taneciğinin 18 elektronu vardır. Sayıları eşittir. Bu ifade doğrudur.\nB) İzobar, kütle numaraları aynı, proton sayıları farklı olan atomlardır. Ar ve Ca²⁺ taneciklerinin ikisinin de kütle numarası 40, proton sayıları ise sırasıyla 18 ve 20'dir. Dolayısıyla izobardırlar. Bu ifade doğrudur.\nC) K⁺ taneciğinin nötron sayısı 20, Ca²⁺ taneciğinin nötron sayısı 20'dir. Nötron sayıları eşittir, yani bu iki tanecik izotondur. İfadede 'farklıdır' dendiği için bu ifade yanlıştır.\nD) Üç tanecik de izoelektroniktir (hepsi 18 elektrona sahiptir). İzoelektronik taneciklerde proton sayısı en az olanın yarıçapı en büyüktür çünkü çekirdeğin elektronlar üzerindeki çekim kuvveti daha azdır. Proton sayıları K⁺(19), Ar(18) ve Ca²⁺(20) olduğundan, en az protona sahip Ar'nin yarıçapı en büyüktür. Bu ifade doğrudur.\nE) Üç taneciğin de elektron sayısı 18 olduğu için birbirleriyle izoelektroniktirler. Bu ifade doğrudur.",
    "difficulty": 3
  }
]