[
  {
    "id": "ai_1764500335419_0",
    "subjectId": "tur",
    "topic": "Cümle Yapısı",
    "questionText": "Güneşin batışını izlerken, gökyüzünün kızıla boyanmasıyla birlikte içimde tarifsiz bir hüzün belirdi.\n\nBu cümlenin yapısı aşağıdakilerden hangisidir?",
    "options": [
      "Basit Cümle",
      "Sıralı Cümle",
      "Girişik Birleşik Cümle",
      "Bağlı Cümle",
      "Şartlı Birleşik Cümle"
    ],
    "correctAnswer": 2,
    "explanation": "Bu cümle, tek bir temel yargı (yüklem: belirdi) içerdiği ve bu temel yargıya bağlı fiilimsi (zarf-fiil: izlerken) barındırdığı için yapıca \"Girişik Birleşik Cümle\"dir. Cümlenin tek bir yüklemi vardır, bu nedenle basit cümle değildir. Birden fazla cümlenin virgül veya noktalı virgülle bağlanmaması nedeniyle sıralı cümle, bağlaçla bağlanmaması nedeniyle de bağlı cümle değildir. İçinde şart anlamı taşıyan bir ek (-se/-sa) bulunmadığı için şartlı birleşik cümle de olamaz. Cümledeki \"izlerken\" zarf-fiili, yan cümlecik kurarak cümleyi birleşik yapılı hale getirmiştir.",
    "difficulty": 3
  },
  {
    "id": "ai_1764500335419_1",
    "subjectId": "tur",
    "topic": "Cümle Yapısı",
    "questionText": "Uzak diyarlardan gelen bu eski mektubu, yıllardır kimsenin açmadığı o sandıkta buldum dün akşam.\n\nBu cümleyle ilgili aşağıdaki yargılardan hangisi doğrudur?",
    "options": [
      "Yüklemin türüne göre isim, öge dizilişine göre kurallı bir cümledir.",
      "Yapısına göre basit, anlamına göre olumlu bir cümledir.",
      "Öge dizilişine göre devrik, yapısına göre birleşik bir cümledir.",
      "Yapısına göre sıralı, anlamına göre olumlu bir cümledir.",
      "Yüklemin türüne göre fiil, öge dizilişine göre kurallı bir cümledir."
    ],
    "correctAnswer": 2,
    "explanation": "Cümleyi inceleyelim:\n1. **Yüklem:** \"buldum\" kelimesi bir fiil olduğu için cümle \"fiil cümlesi\"dir.\n2. **Öge Dizilişi:** Yüklem olan \"buldum\" kelimesi cümlenin sonunda yer almadığı için cümle \"devrik cümle\"dir.\n3. **Yapısı:** Cümlenin tek bir yüklemi (\"buldum\") olmasına rağmen içinde \"gelen\" (sıfat-fiil) ve \"açmadığı\" (sıfat-fiil) gibi fiilimsiler bulunmaktadır. İçinde fiilimsi bulunan ve tek yüklemi olan cümleler \"birleşik cümle\"dir.\n4. **Anlamı:** Bulma eylemi gerçekleştiği için cümle \"olumlu cümle\"dir.\nBu bilgilere göre, C seçeneğindeki \"Öge dizilişine göre devrik, yapısına göre birleşik bir cümledir.\" ifadesi doğrudur. Diğer şıklar yanlıştır çünkü A'da \"isim\" ve \"kurallı\", B'de \"basit\", D'de \"sıralı\", E'de ise \"kurallı\" ifadeleri hatalıdır.",
    "difficulty": 3
  }
]