[
  {
    "id": "ai_1764500200762_0",
    "subjectId": "biy",
    "topic": "Dolaşım Sistemi",
    "questionText": "İnsanın dolaşım sisteminde yer alan damarlarla ilgili aşağıdaki ifadelerden hangisi yanlıştır?",
    "options": [
      "Atardamarların duvarları, toplardamarlara göre daha kalın ve elastik lifler bakımından daha zengindir.",
      "Vücudun alt kısımlarındaki toplardamarlarda kanın geri akışını engelleyen tek yönlü kapakçıklar bulunur.",
      "Kan akış hızının en yavaş olduğu damarlar, madde alışverişinin gerçekleştiği kılcal damarlardır.",
      "Bir organa giren atardamar ile o organdan çıkan toplardamar arasındaki kanın alyuvar sayısı yaklaşık olarak aynıdır.",
      "Vücuttaki toplam kan hacminin en büyük kısmı, yüksek basınç nedeniyle atardamarlarda depolanır."
    ],
    "correctAnswer": 4,
    "explanation": "Vücuttaki toplam kan hacminin en büyük kısmı (%60-70 civarı) atardamarlarda değil, toplardamarlarda bulunur. Toplardamarların duvarları daha az elastik ve daha geniştir, bu da onların daha fazla kan depolamasına olanak tanır. Atardamarlar ise kanı yüksek basınçla taşıdıkları için duvarları kalındır ancak kanı depolama kapasiteleri toplardamarlara göre daha azdır. Diğer şıklar doğrudur: A) Atardamarlar yüksek basınca dayanıklı olmalıdır. B) Yerçekimine karşı kanın taşınmasına kapakçıklar yardım eder. C) Toplam kesit alanı en fazla olan kılcal damarlarda kan akışı yavaşlayarak madde alışverişine imkan tanır. D) Sağlıklı bir bireyde kan üretimi ve yıkımı dengede olduğu için, bir organdan geçen kanda alyuvar sayısı önemli ölçüde değişmez.",
    "difficulty": 3
  },
  {
    "id": "ai_1764500200762_1",
    "subjectId": "biy",
    "topic": "Dolaşım Sistemi",
    "questionText": "Sağlıklı bir insanda, sol karıncıktan pompalanan ve oksijence zengin kanın, böbreklere ulaştıktan sonra tekrar sağ kulakçığa dönene kadar izlediği yolda aşağıdaki yapılardan hangisinden geçmesi beklenmez?",
    "options": [
      "Aort atardamarı",
      "Böbrek toplardamarı",
      "Akciğer atardamarı",
      "Alt ana toplardamar",
      "Böbrek kılcalları"
    ],
    "correctAnswer": 2,
    "explanation": "Bu soru, büyük kan dolaşımının (sistemik dolaşım) yolunu sormaktadır. Sol karıncıktan pompalanan kan şu yolu izler: Sol karıncık → Aort atardamarı → Böbrek atardamarı → Böbrek kılcalları → Böbrek toplardamarı → Alt ana toplardamar → Sağ kulakçık. Bu yolculuk sırasında kan, vücut dokularını (bu örnekte böbrekleri) dolaşır ve oksijenini bırakıp karbondioksit alır. Akciğer atardamarı ise küçük kan dolaşımının (pulmoner dolaşım) bir parçasıdır. Küçük kan dolaşımı, sağ karıncıktan başlar, kirli kanı akciğer atardamarı ile akciğerlere taşır, kanın temizlenmesini sağlar ve akciğer toplardamarı ile temiz kanı sol kulakçığa geri getirir. Dolayısıyla, sol karıncıktan başlayıp sağ kulakçıkta biten büyük dolaşım sırasında kan akciğer atardamarından geçmez.",
    "difficulty": 3
  }
]