[
  {
    "id": "ai_1764501480375_0",
    "subjectId": "biy",
    "topic": "Dolaşım Sistemi",
    "questionText": "İnsan dolaşım sisteminde, sol karıncıktan pompalanan kanın sağ kulakçığa gelene kadar izlediği yolda aşağıdaki damarların hangisinden geçmesi beklenmez?",
    "options": [
      "Aort atardamarı",
      "Böbrek atardamarı",
      "Akciğer atardamarı",
      "Kapı toplardamarı",
      "Alt ana toplardamar"
    ],
    "correctAnswer": 2,
    "explanation": "Sol karıncıktan pompalanan temiz kan, büyük kan dolaşımına katılır. Bu dolaşım, kanın aort atardamarı ile tüm vücuda dağıtılmasıyla başlar. Kan, böbrek atardamarı gibi organ atardamarlarıyla organlara ulaşır. Sindirim organlarından gelen kan, kapı toplardamarı ile karaciğere uğradıktan sonra, vücudun alt kısımlarından gelen diğer kanla birlikte alt ana toplardamar aracılığıyla kalbin sağ kulakçığına döner. Akciğer atardamarı ise küçük kan dolaşımına aittir ve sağ karıncıktan pompalanan kirli kanı temizlenmesi için akciğerlere taşır. Dolayısıyla, büyük kan dolaşımı sırasında kan akciğer atardamarından geçmez.",
    "difficulty": 3
  },
  {
    "id": "ai_1764501480375_1",
    "subjectId": "biy",
    "topic": "Dolaşım Sistemi",
    "questionText": "İnsan kalbinin çalışmasını düzenleyen faktörlerle ilgili aşağıdaki ifadelerden hangisi yanlıştır?",
    "options": [
      "Kandaki karbondioksit miktarının artması, kan pH'ını düşürerek omurilik soğanını uyarır ve kalp atışını hızlandırır.",
      "Sempatik sinirlerden salgılanan noradrenalin, kalp atış hızını artıran bir etki gösterir.",
      "Vücut sıcaklığının normalin üzerine çıkması, sinoatriyal düğümün uyarılmasını yavaşlatarak kalp atışını düşürür.",
      "Parasempatik sinirlerden olan vagus sinirinden salgılanan asetilkolin, kalp atışını yavaşlatır.",
      "Adrenalin ve tiroksin gibi hormonlar, metabolizmayı hızlandırarak kalbin çalışma hızını artırır."
    ],
    "correctAnswer": 2,
    "explanation": "Kalp atış hızı, otonom sinir sistemi ve hormonal faktörler tarafından kontrol edilir. Vücut sıcaklığının yükselmesi (ateş gibi durumlarda), metabolizmayı ve sinirsel iletimi hızlandırır. Bu durum, kalbin pacemaker'ı olan sinoatriyal (SA) düğümün daha sık uyarılmasına neden olarak kalp atış hızını artırır, yavaşlatmaz. Diğer seçenekler doğrudur: Yüksek CO2 (düşük pH) kalp atışını hızlandırır. Sempatik sistem (noradrenalin ile) 'savaş ya da kaç' tepkisiyle kalbi hızlandırır. Parasempatik sistem (asetilkolin ile) ise 'dinlen ve sindir' durumuyla kalbi yavaşlatır. Adrenalin ve tiroksin hormonları da metabolizmayı ve dolayısıyla kalp atışını hızlandırır.",
    "difficulty": 3
  }
]