[
  {
    "id": "ai_1764501038499_0",
    "subjectId": "fiz",
    "topic": "Elektrik",
    "questionText": "İç direnci önemsiz bir üreteç, 2 Ω ve 4 Ω'luk iki dirençle seri olarak bağlanmıştır. Üretecin potansiyel farkı 18 V olduğuna göre, 4 Ω'luk direncin uçları arasındaki potansiyel fark kaç Volt'tur?",
    "options": [
      "A) 3",
      "B) 6",
      "C) 9",
      "D) 12",
      "E) 18"
    ],
    "correctAnswer": 3,
    "explanation": "Seri bağlı devrelerde eşdeğer direnç, dirençlerin toplamına eşittir. Bu nedenle, R_eş = R1 + R2 = 2 Ω + 4 Ω = 6 Ω'dur. Devreden geçen ana kol akımını Ohm Yasası (V = I * R) kullanarak bulabiliriz: I = V / R_eş = 18 V / 6 Ω = 3 A. Seri bağlı devrelerde akım her dirençten aynı miktarda geçer. Bu yüzden 4 Ω'luk dirençten de 3 A akım geçer. 4 Ω'luk direncin uçları arasındaki potansiyel farkı yine Ohm Yasası ile hesaplarız: V_4Ω = I * R_4Ω = 3 A * 4 Ω = 12 V.",
    "difficulty": 3
  },
  {
    "id": "ai_1764501038499_1",
    "subjectId": "fiz",
    "topic": "Elektrik",
    "questionText": "Üzerinde \"220 V - 1100 W\" yazan bir elektrikli ısıtıcı, 220 V'luk bir gerilimle 5 dakika boyunca çalıştırılıyor. Bu süre boyunca ısıtıcının harcadığı elektrik enerjisi kaç kilojoule (kJ)'dür?",
    "options": [
      "A) 5,5",
      "B) 55",
      "C) 330",
      "D) 5500",
      "E) 330000"
    ],
    "correctAnswer": 2,
    "explanation": "Elektriksel enerji (E), güç (P) ile zamanın (t) çarpımına eşittir (E = P * t). Enerjiyi Joule cinsinden bulmak için gücü Watt, zamanı ise saniye cinsinden kullanmalıyız. Isıtıcının gücü P = 1100 W olarak verilmiştir. Çalışma süresi t = 5 dakika = 5 * 60 = 300 saniyedir. Bu değerleri formülde yerine koyarsak: E = 1100 W * 300 s = 330.000 Joule. Soru, enerjiyi kilojoule (kJ) cinsinden istediği için sonucu 1000'e böleriz: E = 330.000 J / 1000 = 330 kJ.",
    "difficulty": 3
  },
  {
    "id": "ai_1764501038499_2",
    "subjectId": "fiz",
    "topic": "Elektrik",
    "questionText": "3 Ω ve 6 Ω'luk iki direnç birbirine paralel olarak bağlanmıştır. Bu paralel bağlı direnç grubundan geçen ana kol akımı 9 A olduğuna göre, 6 Ω'luk direncin üzerinden geçen akım şiddeti kaç Amper'dir?",
    "options": [
      "A) 1,5",
      "B) 3",
      "C) 4,5",
      "D) 6",
      "E) 9"
    ],
    "correctAnswer": 1,
    "explanation": "Paralel bağlı kollarda potansiyel farkları (gerilim) eşittir. Akım ise dirençlerle ters orantılı olarak kollara ayrılır. Yani, büyük dirençten az akım, küçük dirençten çok akım geçer. Dirençlerin oranı R1/R2 = 3/6 = 1/2'dir. Bu durumda akımlar I1/I2 = 2/1 oranında paylaşılacaktır. Toplam akım 9 A, toplam oran ise 2+1=3'tür. Bir oran birimi 9 A / 3 = 3 A'e eşittir. 6 Ω'luk direnç (büyük olan), 1 birim akım alacaktır, yani 1 * 3 A = 3 A. 3 Ω'luk direnç (küçük olan) ise 2 birim akım alacaktır, yani 2 * 3 A = 6 A. Toplam akım 3 A + 6 A = 9 A olarak doğrulanır. Dolayısıyla, 6 Ω'luk dirençten geçen akım 3 A'dir.",
    "difficulty": 3
  },
  {
    "id": "ai_1764501038499_3",
    "subjectId": "fiz",
    "topic": "Elektrik",
    "questionText": "Aralarında d mesafesi bulunan +q ve +4q yüklü noktasal cisimler sabitlenmiştir. +q yükünden ne kadar uzakta, bu iki yükün oluşturduğu bileşke elektrik alan sıfır olur?",
    "options": [
      "A) d/5",
      "B) d/4",
      "C) d/3",
      "D) d/2",
      "E) 2d/3"
    ],
    "correctAnswer": 2,
    "explanation": "Bileşke elektrik alanın sıfır olabilmesi için, iki yükün oluşturduğu elektrik alanların o noktada eşit büyüklükte ve zıt yönlü olması gerekir. Yüklerin ikisi de pozitif olduğu için, bu durum sadece iki yükün arasında bir noktada gerçekleşebilir. Bu noktaya P diyelim ve +q yüküne olan uzaklığına x diyelim. Bu durumda +4q yüküne olan uzaklığı (d-x) olur. Elektrik alan formülü E = k*Q/r²'dir. P noktasında alanların büyüklüklerini eşitleyelim: E_q = E_4q => k*|q|/x² = k*|4q|/(d-x)². Sadeleştirme yaparsak: 1/x² = 4/(d-x)². Her iki tarafın karekökünü alırsak: 1/x = 2/(d-x). İçler dışlar çarpımı yaparsak: d - x = 2x => d = 3x => x = d/3. Sonuç olarak, bileşke elektrik alan +q yükünden d/3 uzaklıkta sıfır olur.",
    "difficulty": 3
  }
]