[
  {
    "id": "ai_1764499640304_0",
    "subjectId": "fiz",
    "topic": "Enerji",
    "questionText": "Kütlesi m olan bir cisim, sürtünmeli eğik düzlemin K noktasından serbest bırakıldığında L noktasına v hızıyla ulaşıyor. K noktasının yerden yüksekliği h olduğuna göre, sürtünme kuvvetinin yaptığı iş (ısıya dönüşen enerji) aşağıdaki ifadelerden hangisine eşittir? (g: yer çekimi ivmesi)",
    "options": [
      "1/2 mv²",
      "mgh",
      "mgh - 1/2 mv²",
      "mgh + 1/2 mv²",
      "1/2 mv² - mgh"
    ],
    "correctAnswer": 2,
    "explanation": "Enerjinin korunumu ilkesine göre, sürtünme gibi korunumsuz bir kuvvetin varlığında sistemin başlangıçtaki mekanik enerjisi, son durumdaki mekanik enerjisi ile ısıya dönüşen enerjinin toplamına eşittir. Başlangıçta cisim serbest bırakıldığı için sadece potansiyel enerjisi vardır (E_ilk = mgh). L noktasına ulaştığında ise sadece kinetik enerjisi vardır (E_son = 1/2 mv²). Aradaki fark, sürtünme kuvvetinin yaptığı işe, yani ısıya dönüşen enerjiye (W_sürtünme) eşittir. Bu durumda denklem: E_ilk = E_son + W_sürtünme => mgh = 1/2 mv² + W_sürtünme. Buradan W_sürtünme = mgh - 1/2 mv² bulunur.",
    "difficulty": 3
  },
  {
    "id": "ai_1764499640304_1",
    "subjectId": "fiz",
    "topic": "Enerji",
    "questionText": "Yatay bir yolda sabit v hızıyla hareket eden bir otomobile etki eden toplam sürtünme kuvvetinin büyüklüğü F_s'dir. Buna göre, otomobil motorunun anlık gücü (P) aşağıdakilerden hangisine eşittir?",
    "options": [
      "F_s ⋅ v",
      "F_s / v",
      "F_s ⋅ v²",
      "1/2 F_s ⋅ v²",
      "Sıfır"
    ],
    "correctAnswer": 0,
    "explanation": "Otomobil sabit hızla hareket ettiğine göre, Newton'un birinci hareket yasası gereği üzerine etki eden net kuvvet sıfırdır. Bu durum, motorun uyguladığı ileri yöndeki kuvvetin (F_motor), harekete zıt yöndeki toplam sürtünme kuvvetine (F_s) eşit büyüklükte olmasını gerektirir (F_motor = F_s). Güç (P), kuvvet ile hızın skaler çarpımıdır (P = F ⋅ v). Burada F, cismi hareket ettiren kuvvettir. Dolayısıyla motorun gücü: P = F_motor ⋅ v = F_s ⋅ v olur.",
    "difficulty": 3
  }
]