[
  {
    "id": "ai_1764501416919_0",
    "subjectId": "biy",
    "topic": "Genetik",
    "questionText": "Bezelyelerde sarı tohum rengi aleli (S), yeşil tohum rengi aleline (s); düzgün tohum şekli aleli (D) ise buruşuk tohum şekli aleline (d) baskındır. Genleri bağımsız olan ve her iki karakter bakımından da heterozigot olan iki bezelyenin (SsDd x SsDd) çaprazlanması sonucunda, fenotipinde sarı renkli ve buruşuk tohumlu bir bezelyenin oluşma olasılığı nedir?",
    "options": [
      "1/16",
      "9/16",
      "3/16",
      "1/4",
      "3/4"
    ],
    "correctAnswer": 2,
    "explanation": "Bu bir dihibrit çaprazlamadır ve genler bağımsız olduğu için her bir karakterin kalıtımı ayrı ayrı incelenmelidir. \n1. Renk karakteri için çaprazlama: Ss x Ss. Bu çaprazlamadan oluşacak fenotipik oran 3/4 Sarı (S_) ve 1/4 Yeşil (ss)'dir.\n2. Şekil karakteri için çaprazlama: Dd x Dd. Bu çaprazlamadan oluşacak fenotipik oran 3/4 Düzgün (D_) ve 1/4 Buruşuk (dd)'tur.\nSoruda istenen 'sarı renkli' VE 'buruşuk tohumlu' fenotiptir. Bağımsız olayların birlikte gerçekleşme olasılığı, bu olayların ayrı ayrı gerçekleşme olasılıklarının çarpımı ile bulunur (Çarpma Kuralı).\nOlasılık = P(Sarı) x P(Buruşuk) = (3/4) x (1/4) = 3/16. Bu nedenle doğru cevap 3/16'dır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764501416919_1",
    "subjectId": "biy",
    "topic": "Genetik",
    "questionText": "Renk körlüğü, X kromozomuna bağlı çekinik bir alel ile kalıtılan bir hastalıktır. Renk körü bir baba ile bu özellik bakımından taşıyıcı (heterozigot) bir annenin, renk körü bir kız çocuğuna sahip olma olasılığı kaçtır?",
    "options": [
      "1/8",
      "1/4",
      "1/2",
      "3/4",
      "0"
    ],
    "correctAnswer": 1,
    "explanation": "Babanın genotipi X^rY, annenin genotipi ise X^RX^r'dir. Bu ebeveynlerin çocuklarının olası genotiplerini bulmak için Punnett karesi kullanılır:\n- X^R X^r: Taşıyıcı kız çocuğu\n- X^r X^r: Renk körü kız çocuğu\n- X^R Y: Sağlam erkek çocuğu\n- X^r Y: Renk körü erkek çocuğu\nToplamda dört olası ve eşit ihtimalli genotip vardır. Bu olasılıklar arasında 'renk körü bir kız çocuğu'nun (X^rX^r) ortaya çıkma olasılığı 1/4'tür. Bu oran %25'e karşılık gelir.",
    "difficulty": 3
  },
  {
    "id": "ai_1764501416919_2",
    "subjectId": "biy",
    "topic": "Genetik",
    "questionText": "İnsanlarda görülen bazı genetik hastalıklar, mayoz bölünme sırasında meydana gelen ayrılmama olayları sonucu ortaya çıkan kromozom sayısı anormalliklerinden kaynaklanır.\n I. Down Sendromu - 45 + XX\n II. Turner Sendromu - 44 + X\n III. Klinefelter Sendromu - 44 + XXY\nYukarıda verilen sendromlar ve bu sendromlara sahip bireylerin kromozom formülleri eşleştirmelerinden hangileri doğrudur?",
    "options": [
      "Yalnız I",
      "Yalnız II",
      "I ve II",
      "II ve III",
      "I, II ve III"
    ],
    "correctAnswer": 4,
    "explanation": "Verilen kromozom formülleri 'otozom sayısı + gonozomlar' şeklinde ifade edilmiştir. Sağlıklı bir insanda 44 otozom + XX (dişi) veya 44 otozom + XY (erkek) kromozomu bulunur.\nI. Down Sendromu (Trizomi 21): Otozomal bir kromozom olan 21. kromozomdan üç tane bulunmasıdır. Yani normaldeki 44 otozoma bir tane eklenir. Dişi bir birey için formül 45 otozom + XX gonozom şeklinde yazılabilir ve bu toplam 47 kromozom anlamına gelir. Bu ifade doğrudur.\nII. Turner Sendromu: Gonozomlardan birinin eksik olması durumudur (45, X0). Birey 44 otozom ve tek bir X gonozomu taşır. Formülü 44 + X şeklindedir. Bu ifade doğrudur.\nIII. Klinefelter Sendromu: Erkek bireyde fazladan bir X gonozomu bulunması durumudur (47, XXY). Birey 44 otozom ve XXY gonozomlarını taşır. Formülü 44 + XXY şeklindedir. Bu ifade de doğrudur.\nBu nedenle her üç eşleştirme de doğrudur.",
    "difficulty": 3
  }
]