[
  {
    "id": "ai_1764498693499_0",
    "subjectId": "biy",
    "topic": "Hücre",
    "questionText": "Aşağıdaki hücresel yapılardan hangisi, hem oksijenli solunum yapan bir bakteri hücresinde hem de bir hayvan hücresinde ortak olarak bulunur?",
    "options": [
      "Mitokondri",
      "Hücre duvarı",
      "Ribozom",
      "Çekirdek",
      "Lizozom"
    ],
    "correctAnswer": 2,
    "explanation": "Ribozom, protein sentezinden sorumlu olan ve zarsız bir organeldir. Bu nedenle hem prokaryotik (bakteri) hem de ökaryotik (hayvan) hücrelerde ortak olarak bulunur. Mitokondri, çekirdek ve lizozom zarlı organeller olup sadece ökaryotik hücrelerde bulunur. Hayvan hücrelerinde hücre duvarı bulunmazken, bakterilerde peptidoglikan yapılı bir hücre duvarı bulunur. Ancak soru her iki hücrede de 'ortak olarak' bulunan yapıyı sorduğu için doğru cevap ribozomdur.",
    "difficulty": 3
  },
  {
    "id": "ai_1764498693499_1",
    "subjectId": "biy",
    "topic": "Hücre",
    "questionText": "Ökaryotik bir hücrede, hücre dışına salgılanacak bir glikoprotein molekülünün üretim ve salgılanma sürecinde aşağıdaki organellerden hangisi en son görev alır?",
    "options": [
      "Granüllü endoplazmik retikulum",
      "Ribozom",
      "Golgi cisimciği",
      "Mitokondri",
      "Lizozom"
    ],
    "correctAnswer": 2,
    "explanation": "Hücre dışına salgılanacak bir glikoproteinin sentez süreci şu sırayla gerçekleşir: 1) Ribozomda protein kısmı sentezlenir. 2) Sentezlenen protein, granüllü endoplazmik retikulum (GER) kanalına girer ve burada ilk şeker eklemeleri (glikozilasyon) yapılarak üç boyutlu yapısını kazanır. 3) GER'den ayrılan taşıma kofulu, proteini Golgi cisimciğine taşır. 4) Golgi cisimciğinde protein son halini alır, sınıflandırılır, paketlenir ve salgı kofulu oluşturulur. Bu koful daha sonra hücre zarına giderek içeriğini ekzositozla dışarı bırakır. Bu sıralamada en son görev alan organel Golgi cisimciğidir. Mitokondri bu süreç için enerji (ATP) üretir ancak sentez yolunda doğrudan yer almaz. Lizozom ise hücre içi sindirimde görevlidir.",
    "difficulty": 3
  }
]