[
  {
    "id": "ai_1764501369437_0",
    "subjectId": "biy",
    "topic": "Hücre",
    "questionText": "Prokaryot ve ökaryot hücreler, yaşamsal faaliyetlerini sürdürebilmek için çeşitli yapılara sahiptir. Bu iki hücre tipi arasındaki temel farklardan biri, zarla çevrili organellerin varlığı veya yokluğudur. Buna göre, aşağıdakilerden hangisi hem prokaryot hem de ökaryot hücrelerde ortak olarak bulunan bir yapıdır?",
    "options": [
      "Mitokondri",
      "Golgi cisimciği",
      "Lizozom",
      "Ribozom",
      "Endoplazmik retikulum"
    ],
    "correctAnswer": 3,
    "explanation": "Prokaryot hücreler, zarla çevrili organellere (mitokondri, golgi, lizozom, endoplazmik retikulum vb.) ve çekirdeğe sahip değildir. Ökaryot hücreler ise bu yapılara sahiptir. Ancak, protein sentezinin gerçekleştiği ribozomlar zarsız yapılardır ve bu nedenle hem prokaryot hem de ökaryot hücrelerde ortak olarak bulunur. Ribozom, bu özelliğiyle evrensel bir organel olarak kabul edilir. Diğer şıklarda verilen organeller ise sadece ökaryot hücrelerde bulunan zarlı organellerdir.",
    "difficulty": 3
  },
  {
    "id": "ai_1764501369437_1",
    "subjectId": "biy",
    "topic": "Hücre",
    "questionText": "Hücre zarından madde geçişleriyle ilgili olarak, aktif taşıma mekanizması için aşağıdakilerden hangisi söylenemez?",
    "options": [
      "Madde geçişi az yoğun ortamdan çok yoğun ortama doğru gerçekleşir.",
      "Taşıyıcı proteinler ve enzimler görev yapar.",
      "Sadece canlı hücrelerde gözlemlenir.",
      "Gerçekleşmesi için ATP enerjisi harcanır.",
      "Hücredeki yoğunluk farkını ortadan kaldırarak dengeyi sağlar."
    ],
    "correctAnswer": 4,
    "explanation": "Aktif taşıma, maddelerin derişimlerinin (yoğunluklarının) az olduğu ortamdan çok olduğu ortama doğru, yani derişim gradyanının tersine taşınmasıdır. Bu işlem için metabolik enerji (ATP) harcanır ve taşıyıcı proteinler ile enzimler görev alır. Enerji gerektirdiği için sadece canlı hücrelerde gerçekleşebilir. Aktif taşımanın amacı, hücre içi ve dışı arasındaki yoğunluk farkını korumak veya artırmaktır; yoğunluk farkını ortadan kaldırarak denge durumunu (izotonik ortam) sağlayan mekanizma ise pasif taşıma (örneğin, difüzyon) yöntemleridir. Bu nedenle E şıkkındaki ifade aktif taşıma için yanlıştır.",
    "difficulty": 3
  }
]