[
  {
    "id": "ai_1764499851398_0",
    "subjectId": "kim",
    "topic": "Kimyasal Bağlar",
    "questionText": "Magnezyum klorür (MgCl₂) ve Karbon tetraklorür (CCl₄) bileşikleri ile ilgili aşağıdaki ifadelerden hangisi yanlıştır? (₆C, ₈O, ₁₂Mg, ₁₇Cl)",
    "options": [
      "MgCl₂ iyonik, CCl₄ ise kovalent bağlı bir bileşiktir.",
      "Oda koşullarında MgCl₂ katı haldeyken, CCl₄ sıvı haldedir.",
      "CCl₄ molekülü apolar olmasına rağmen, C-Cl bağları polar kovalenttir.",
      "MgCl₂'nin sulu çözeltisi elektriği iletirken, CCl₄'ünki iletmez.",
      "Katı halde MgCl₂ moleküllerden, CCl₄ ise iyonik kristal örgüden oluşur."
    ],
    "correctAnswer": 4,
    "explanation": "Verilen ifadeleri inceleyelim:\nA) Mg (metal) ile Cl (ametal) arasında elektron alışverişiyle iyonik bağ oluşur. C (ametal) ile Cl (ametal) arasında elektron ortaklaşmasıyla kovalent bağ oluşur. Bu ifade doğrudur.\nB) İyonik bileşiklerin erime ve kaynama noktaları, moleküler bileşiklere göre çok daha yüksektir. Bu nedenle oda koşullarında (25°C) MgCl₂ katı, CCl₄ ise sıvıdır. Bu ifade doğrudur.\nC) CCl₄'te, C ve Cl atomları arasındaki elektronegatiflik farkından dolayı her bir C-Cl bağı polardır. Ancak molekülün geometrisi düzgün dörtyüzlü olduğundan ve Cl atomları simetrik olarak yerleştiğinden, bağ polarlıkları birbirini sıfırlar ve molekül apolar olur. Bu ifade doğrudur.\nD) MgCl₂, suda Mg²⁺ ve Cl⁻ iyonlarına ayrışarak çözünür ve iyon hareketi sayesinde elektrik akımını iletir. CCl₄ ise apolar bir molekül olduğu için suda çözünmez ve iyon oluşturmadığı için elektrik akımını iletmez. Bu ifade doğrudur.\nE) Bu ifade A seçeneğinde belirtilenlerin tam tersidir. İyonik bağlı MgCl₂ bileşiği, anyon ve katyonların düzenli bir şekilde sıralandığı iyonik kristal örgü yapısına sahiptir. Kovalent bağlı CCl₄ bileşiği ise bağımsız moleküllerden oluşur. Bu ifade yanlıştır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764499851398_1",
    "subjectId": "kim",
    "topic": "Kimyasal Bağlar",
    "questionText": "Kükürt dioksit (SO₂) molekülü ile ilgili aşağıdaki yargılardan hangisi doğrudur? (₁₆S, ₈O)",
    "options": [
      "Molekül geometrisi doğrusaldır.",
      "Molekül apolardır.",
      "Molekül içi bağlar apolar kovalenttir.",
      "Lewis yapısında kükürt atomu üzerinde ortaklanmamış elektron çifti bulunmaz.",
      "Molekülde rezonans yapılar gözlenir."
    ],
    "correctAnswer": 4,
    "explanation": "SO₂ molekülünün özelliklerini inceleyelim:\n1. Lewis Yapısı: Merkez atom kükürttür (S). Kükürt 6A, Oksijen 6A grubundadır. Toplam değerlik elektron sayısı = 6 + 2*6 = 18'dir. Lewis yapısı çizildiğinde, merkez atom S üzerinde bir adet ortaklanmamış elektron çifti (yalın çift) ve S atomunun her iki O atomuyla bir çiftli bir tekli bağ yaptığı (veya iki çiftli bağ yapıp oktetini aştığı) görülür. En kararlı yapı, bir çiftli ve bir tekli bağ içeren rezonans yapılardır.\n2. VSEPR Gösterimi: Merkez atom (A), merkeze bağlı 2 atom (X₂), merkez atomdaki 1 yalın çift (E₁) olmak üzere VSEPR gösterimi AX₂E₁'dir.\nBu bilgilere göre şıkları değerlendirelim:\nA) AX₂E₁ VSEPR gösterimine sahip moleküllerin geometrisi doğrusal değil, kırık doğru (açısal)'dır. Bu ifade yanlıştır.\nB) Molekül geometrisi açısal olduğu için S-O bağlarının oluşturduğu dipol momentler birbirini sıfırlamaz. Bu nedenle molekül polardır. Bu ifade yanlıştır.\nC) Kükürt ve oksijen farklı ametal atomlarıdır ve aralarında elektronegatiflik farkı bulunur. Bu nedenle aralarındaki bağ polar kovalenttir. Bu ifade yanlıştır.\nD) Lewis yapısı çizildiğinde, merkez atom olan kükürt (S) üzerinde bir adet ortaklanmamış (yalın) elektron çifti bulunur. Bu ifade yanlıştır.\nE) SO₂ molekülündeki çift bağ, iki oksijen atomu arasında yer değiştirebilir. Bu durum, molekülün tek bir Lewis yapısıyla ifade edilemediğini ve gerçek yapının bu iki formun bir melezi (rezonans hibriti) olduğunu gösterir. Bu ifade doğrudur.",
    "difficulty": 3
  }
]