[
  {
    "id": "ai_1764499617668_0",
    "subjectId": "fiz",
    "topic": "Kuvvet",
    "questionText": "Yatay bir zemin üzerinde durmakta olan bir cisme, yatay doğrultuda büyüklüğü sıfırdan başlayarak düzgün şekilde artırılan bir F kuvveti uygulanıyor. Cisim harekete başlayana kadar geçen sürede cisme etki eden sürtünme kuvveti (fs) ve cisim sabit hızla hareket ederken etki eden sürtünme kuvveti (fk) için aşağıdakilerden hangisi doğrudur?",
    "options": [
      "fs sabittir; fk ise F kuvvetiyle birlikte artar.",
      "fs, F kuvvetiyle birlikte artar; fk sabittir.",
      "fs ve fk her zaman uygulanan F kuvvetine eşittir.",
      "fs her zaman F kuvvetinden büyüktür; fk ise F kuvvetine eşittir.",
      "fs ve fk daima sabittir ve birbirine eşittir."
    ],
    "correctAnswer": 1,
    "explanation": "Bir cisim duruyorken cisme etki eden sürtünme kuvveti statik sürtünme kuvvetidir (fs). Statik sürtünme kuvvetinin büyüklüğü, cismi harekete zorlayan kuvvete eşittir ve bu kuvvetle birlikte artar. Ancak bu artışın bir maksimum değeri vardır (fs_max = μs * N). Cisim bu maksimum değer aşıldığında harekete başlar. Cisim harekete geçtikten sonra ise cisme etki eden sürtünme kuvveti kinetik sürtünme kuvvetidir (fk). Kinetik sürtünme kuvveti (fk = μk * N) genellikle statik sürtünmenin maksimum değerinden daha küçüktür ve cismin hızı (çok yüksek hızlar hariç) değişmediği sürece sabit bir değere sahiptir. Bu nedenle, cisim dururken fs, F ile birlikte artar; cisim hareket ederken fk ise sabit kalır. Doğru cevap B şıkkıdır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764499617668_1",
    "subjectId": "fiz",
    "topic": "Kuvvet",
    "questionText": "Bir asansörün tavanına asılı dinamometrenin ucunda 5 kg kütleli bir cisim bulunmaktadır. Asansör aşağı yönde 2 m/s²'lik ivme ile yavaşlarken dinamometrenin gösterdiği değer kaç Newton'dur? (g = 10 m/s²)",
    "options": [
      "40 N",
      "50 N",
      "60 N",
      "70 N",
      "80 N"
    ],
    "correctAnswer": 2,
    "explanation": "Cisme etki eden kuvvetler, yukarı yönde dinamometrenin uyguladığı gerilme kuvveti (T) ve aşağı yönde yer çekimi kuvvetidir (G = m*g). Newton'un ikinci hareket yasasına göre net kuvvet, kütle ile ivmenin çarpımına eşittir (F_net = m*a). Asansör aşağı yönde yavaşladığı için, net kuvvet ve ivme yukarı yöndedir. Bu durumda hareket denklemi şu şekilde yazılır:\n\nF_net = T - G\nm*a = T - m*g\n\nBurada 'a' ivmenin büyüklüğüdür. Dinamometrenin gösterdiği değer T gerilme kuvvetidir. Denklemi T için düzenlersek:\n\nT = m*g + m*a = m*(g + a)\nVerilen değerleri yerine koyalım:\nm = 5 kg\ng = 10 m/s²\na = 2 m/s²\n\nT = 5 * (10 + 2)\nT = 5 * 12\nT = 60 N\n\nBu nedenle dinamometrenin gösterdiği değer 60 N'dur. Doğru cevap C şıkkıdır.",
    "difficulty": 3
  }
]