[
  {
    "id": "ai_1764499796212_0",
    "subjectId": "fiz",
    "topic": "Modern Fizik",
    "questionText": "Eşik enerjisi 2 eV olan bir metal yüzeye, enerjisi 5 eV olan fotonlar gönderiliyor. Bu deneyde, yüzeyden sökülen fotoelektronların maksimum kinetik enerjisi E, sökülen elektron sayısını etkileyen temel faktör ise I ile gösteriliyor. Buna göre, metal yüzeye gönderilen fotonların sadece frekansı artırılırsa E ve I nicelikleri nasıl değişir?",
    "options": [
      "E artar, I artar.",
      "E artar, I değişmez.",
      "E azalır, I artar.",
      "E değişmez, I artar.",
      "E değişmez, I değişmez."
    ],
    "correctAnswer": 1,
    "explanation": "Fotoelektrik olayda, bir fotonun enerjisi (hf) metalin eşik enerjisini (W₀) aştığında elektron sökülür. Sökülen elektronun maksimum kinetik enerjisi Einstein'ın fotoelektrik denklemi ile verilir: E_kinetik = hf - W₀. Burada hf gelen fotonun enerjisidir. Gelen ışığın frekansı (f) artırılırsa, fotonun enerjisi (hf) de artar. Metalin eşik enerjisi (W₀) sabit olduğundan, sökülen elektronların maksimum kinetik enerjisi (E) artar. Sökülen elektron sayısı (akım şiddeti), birim zamanda yüzeye düşen foton sayısına, yani ışık şiddetine (yoğunluğuna) bağlıdır. Soruda sadece frekansın artırıldığı belirtildiği için, ışık şiddeti (I) değişmez kabul edilir. Bu nedenle sökülen elektron sayısı değişmez. Sonuç olarak E artar, I değişmez.",
    "difficulty": 3
  },
  {
    "id": "ai_1764499796212_1",
    "subjectId": "fiz",
    "topic": "Modern Fizik",
    "questionText": "Compton saçılması deneyinde, durgun haldeki bir elektrona gönderilen X-ışını fotonu, elektrona çarparak şekildeki gibi saçılıyor. Gelen fotonun dalga boyu λ, saçılan fotonun dalga boyu λ' ve saçılan elektronun kinetik enerjisi E_k olduğuna göre, aşağıdaki yargılardan hangisi yanlıştır?",
    "options": [
      "Olayda enerji korunur.",
      "Olayda momentum korunur.",
      "Saçılan fotonun dalga boyu, gelen fotonun dalga boyundan büyüktür (λ' > λ).",
      "Gelen fotonun enerjisi, saçılan fotonun enerjisi ile saçılan elektronun kinetik enerjisinin toplamına eşittir.",
      "Saçılan fotonun frekansı, gelen fotonun frekansından büyüktür."
    ],
    "correctAnswer": 4,
    "explanation": "Compton saçılması, bir fotonun serbest bir elektrona esnek çarpması olarak modellenebilir. Bu olayda hem enerji hem de momentum korunur. Gelen foton, enerjisinin bir kısmını elektrona aktararak onun kinetik enerji kazanmasını sağlar ve kendisi daha düşük bir enerjiyle saçılır. Enerji korunumuna göre; E_gelen = E_saçılan + E_kinetik (elektron). Bu nedenle D şıkkı doğrudur. Bir fotonun enerjisi E = hf = hc/λ ile ifade edilir. Saçılan fotonun enerjisi azaldığı için frekansı azalır (f' < f) ve dalga boyu artar (λ' > λ). Dolayısıyla C şıkkı doğru, E şıkkı yanlıştır. Olay bir esnek çarpışma olduğu için A ve B şıklarında belirtildiği gibi enerji ve momentum korunur. Yanlış olan ifade E şıkkındadır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764499796212_2",
    "subjectId": "fiz",
    "topic": "Modern Fizik",
    "questionText": "Özel görelilik teorisine göre, durgun bir gözlemciye göre 0,6c hızıyla hareket eden bir uzay mekiğinin içindeki bir saatin 10 saniye ilerlediği gözlemleniyor. Buna göre, mekiğin içindeki astronota göre aynı zaman aralığı kaç saniye olarak ölçülür? (c: ışık hızı)",
    "options": [
      "6 s",
      "8 s",
      "10 s",
      "12,5 s",
      "16,7 s"
    ],
    "correctAnswer": 1,
    "explanation": "Özel görelilik teorisine göre, hareketli bir referans sisteminde zaman, durgun referans sistemine göre daha yavaş akar. Bu olaya 'zaman genişlemesi' denir. Durgun gözlemcinin ölçtüğü zaman (Δt) ile hareketli gözlemcinin (astronotun) ölçtüğü zaman (Δt₀ - öz zaman) arasındaki ilişki şu formülle verilir: Δt = γ * Δt₀. Burada γ (Lorentz faktörü) = 1 / √(1 - v²/c²)'dir. Soruda verilenler: v = 0,6c ve durgun gözlemcinin ölçtüğü zaman Δt = 10 s. Astronotun kendi saatine göre ölçtüğü zaman Δt₀ sorulmaktadır. Önce γ'yı hesaplayalım: γ = 1 / √(1 - (0,6c)²/c²) = 1 / √(1 - 0,36c²/c²) = 1 / √(1 - 0,36) = 1 / √0,64 = 1 / 0,8 = 10/8 = 1,25. Şimdi formülü kullanarak Δt₀'ı bulalım: 10 = 1,25 * Δt₀ => Δt₀ = 10 / 1,25 = 8 saniye. Dolayısıyla, mekiğin içindeki astronot için geçen süre 8 saniyedir.",
    "difficulty": 3
  }
]