[
  {
    "id": "ai_1764500388936_0",
    "subjectId": "tur",
    "topic": "Noktalama",
    "questionText": "Aşağıdaki cümlede ayraçla ( ) belirtilen yerlere sırasıyla hangi noktalama işaretleri getirilmelidir?\n\n\"At ölür ( ) meydan kalır ( ) yiğit ölür ( ) şan kalır ( ) derler atalarımız.\"",
    "options": [
      "(,) (;) (,) (,)",
      "(;) (,) (;) (,)",
      "(,) (,) (,) (;)",
      "(,) (;) (;) (,)",
      "(;) (,) (,) (;)"
    ],
    "correctAnswer": 0,
    "explanation": "Bu atasözü, kendi içinde virgül bulunan sıralı cümlelerden oluşmuş iki ayrı grubu barındırır. Birinci grup \"At ölür, meydan kalır\" ve ikinci grup \"yiğit ölür, şan kalır\" şeklindedir. Türk Dil Kurumu'nun kurallarına göre, ögeleri arasında virgül bulunan sıralı cümleleri birbirinden ayırmak için noktalı virgül (;) kullanılır. Bu nedenle \"meydan kalır\" ifadesinden sonra noktalı virgül getirilmelidir. Grupların kendi içindeki sıralı cümleleri ayırmak için ise virgül (,) kullanılır. Cümlenin sonundaki virgül ise, alıntı cümlenin bitip ana cümlenin yükleminin (\"derler\") başladığını belirtmek için konulmuştur. Bu durumda doğru sıralama virgül, noktalı virgül, virgül, virgül şeklinde olmalıdır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764500388936_1",
    "subjectId": "tur",
    "topic": "Noktalama",
    "questionText": "Aşağıdaki cümlelerin hangisinde noktalama yanlışı yapılmıştır?",
    "options": [
      "Desem ki vakitlerden bir nisan akşamıdır; rüzgârların en ferahlatıcısı senden esiyor...",
      "Bu karar, Meclisin 17'nci birleşiminin 2'nci oturumunda oy birliğiyle alındı.",
      "Ankara'ya -doğup büyüdüğüm o güzel şehre- yıllar sonra tekrar dönmüştüm.",
      "Eve geldi mi, hemen televizyonu açar, saatlerce kanallar arasında gezinirdi.",
      "Bu projeyi ya yarın bitireceğiz, ya da sunuma yetiştiremeyeceğiz."
    ],
    "correctAnswer": 4,
    "explanation": "Türkçede tekrarlı bağlaçlardan (hem... hem..., ne... ne..., ya... ya...) önce veya sonra virgül kullanılmaz. E şıkkındaki cümlede \"ya... ya da...\" tekrarlı bağlacı kullanılmıştır ve bu bağlaçların arasına virgül konulması bir noktalama hatasıdır. Cümlenin doğru yazımı \"Bu projeyi ya yarın bitireceğiz ya da sunuma yetiştiremeyeceğiz.\" şeklinde olmalıdır. Diğer şıklardaki noktalama işaretlerinin kullanımları doğrudur: A'da sıralı cümleleri ayırmak için noktalı virgül ve bitmemiş cümle sonunda üç nokta; B'de sıra bildiren sayılardan sonra nokta; C'de ara sözü belirtmek için kısa çizgi; D'de zarf-fiil eki yerine kullanılan \"mi\" edatından sonra virgül doğru kullanılmıştır.",
    "difficulty": 3
  }
]