[
  {
    "id": "ai_1764499767243_0",
    "subjectId": "fiz",
    "topic": "Optik",
    "questionText": "Kırıcılık indisi n₁ olan ortamdan, kırıcılık indisi n₂ olan ortama gönderilen tek renkli bir ışık ışınının izlediği yol şekildeki gibidir. Buna göre, ışığın bu ortamlardaki frekansı (f), hızı (v) ve dalga boyu (λ) ile ilgili aşağıdaki yargılardan hangisi doğrudur?",
    "options": [
      "f₁ = f₂, v₁ > v₂, λ₁ > λ₂",
      "f₁ > f₂, v₁ < v₂, λ₁ < λ₂",
      "f₁ = f₂, v₁ < v₂, λ₁ < λ₂",
      "f₁ < f₂, v₁ > v₂, λ₁ > λ₂",
      "f₁ = f₂, v₁ < v₂, λ₁ > λ₂"
    ],
    "correctAnswer": 2,
    "explanation": "Işık bir ortamdan başka bir ortama geçtiğinde frekansı değişmez, çünkü frekans kaynağa bağlıdır. Dolayısıyla f₁ = f₂'dir. Şekilde ışının normalden uzaklaşarak kırıldığı görülmektedir. Snell Yasası'na göre, ışın normalden uzaklaşıyorsa az yoğun ortama geçiyor demektir. Bu durumda n₁ > n₂'dir. Işığın ortamdaki hızı kırıcılık indisi ile ters orantılıdır (v = c/n). n₁ > n₂ olduğu için, v₁ < v₂ olmalıdır. v = λf formülüne göre frekans (f) sabitken, hız (v) ile dalga boyu (λ) doğru orantılıdır. v₁ < v₂ olduğu için, λ₁ < λ₂ olmalıdır. Sonuç olarak doğru sıralama: f₁ = f₂, v₁ < v₂, λ₁ < λ₂'dir.",
    "difficulty": 3
  },
  {
    "id": "ai_1764499767243_1",
    "subjectId": "fiz",
    "topic": "Optik",
    "questionText": "Odak uzaklığı f olan ince kenarlı bir merceğin önüne, optik eksene dik olarak konulan bir cismin görüntüsü, merceğin diğer tarafında ve mercekten 3f uzaklıkta oluşuyor. Buna göre, cisim mercekten ne kadar uzaktadır ve oluşan görüntünün özellikleri nelerdir?",
    "options": [
      "Cisim 1.5f uzağındadır; görüntü gerçek, ters ve boyu cismin boyunun 2 katıdır.",
      "Cisim 2f uzağındadır; görüntü gerçek, ters ve boyu cismin boyuna eşittir.",
      "Cisim 3f uzağındadır; görüntü gerçek, ters ve boyu cismin boyunun 1.5 katıdır.",
      "Cisim 1.5f uzağındadır; görüntü sanal, düz ve boyu cismin boyunun 2 katıdır.",
      "Cisim f/2 uzağındadır; görüntü sanal, düz ve boyu cismin boyunun 2 katıdır."
    ],
    "correctAnswer": 0,
    "explanation": "İnce kenarlı mercek formülü 1/f = 1/d_c + 1/d_g 'dir. Burada d_c cismin uzaklığı, d_g ise görüntünün uzaklığıdır. Görüntü merceğin diğer tarafında oluştuğu için gerçektir ve d_g = +3f olarak alınır. Formülde yerine koyarsak: 1/f = 1/d_c + 1/(3f). Buradan 1/d_c = 1/f - 1/(3f) = (3-1)/3f = 2/(3f) bulunur. Yani d_c = 3f/2 = 1.5f'dir. Büyütme oranı m = -d_g / d_c = -(3f) / (1.5f) = -2'dir. Büyütmenin negatif olması görüntünün terse döndüğünü, mutlak değerinin 1'den büyük olması ise görüntünün cisimden daha büyük olduğunu (2 katı) gösterir. d_g'nin pozitif olması da görüntünün gerçek olduğunu teyit eder. Sonuç olarak, cisim 1.5f uzağındadır ve görüntü gerçek, ters ve boyu cismin boyunun 2 katıdır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764499767243_2",
    "subjectId": "fiz",
    "topic": "Optik",
    "questionText": "Bir gözlemci, hava ortamından suyun içindeki bir balığa baktığında, balığı gerçek derinliğinden daha yakında görür. Bu olayın temel nedeni aşağıdakilerden hangisidir?",
    "options": [
      "Işığın yansıması",
      "Işığın tam yansımaya uğraması",
      "Işığın kırılması",
      "Işığın renklerine ayrılması (kırınım)",
      "Işığın soğurulması"
    ],
    "correctAnswer": 2,
    "explanation": "Gözlemcinin bir cismi görebilmesi için cisimden gelen ışınların göze ulaşması gerekir. Sudan (çok yoğun ortam) havaya (az yoğun ortam) çıkan ışınlar, iki ortamı ayıran yüzeyde normalden uzaklaşarak kırılır. Gözlemcinin gözü, bu kırılan ışınların uzantılarının kesiştiği noktada bir sanal görüntü algılar. Işınlar normalden uzaklaşarak kırıldığı için, uzantıları su yüzeyine daha yakın bir noktada kesişir. Bu nedenle gözlemci, su içindeki balığı gerçekte olduğundan daha sığ bir derinlikte, yani kendisine daha yakın görür. Bu olayın temel nedeni ışığın sudan havaya geçerken kırılmasıdır.",
    "difficulty": 3
  }
]