[
  {
    "id": "ai_1764499998125_0",
    "subjectId": "kim",
    "topic": "Organik Kimya",
    "questionText": "Aşağıdaki bileşik çiftlerinden hangisi birbirinin fonksiyonel grup izomeri *değildir*?",
    "options": [
      "A) Propanal - Propanon",
      "B) Etil alkol - Dimetil eter",
      "C) 2-Pentanon - 3-Pentanon",
      "D) Propanoik asit - Metil etanoat",
      "E) 1-Bütin - 1,3-Bütadien"
    ],
    "correctAnswer": 2,
    "explanation": "Fonksiyonel grup izomerleri, kapalı formülleri aynı ancak fonksiyonel grupları farklı olan bileşiklerdir. A, B, D ve E şıklarındaki çiftler bu tanıma uyar. Örneğin A şıkkında propanal (aldehit) ve propanon (keton) C3H6O kapalı formülüne sahiptir. Ancak C şıkkındaki 2-pentanon ve 3-pentanon, her ikisi de keton fonksiyonel grubuna sahiptir. Bu bileşiklerin kapalı formülleri (C5H10O) aynı olmasına rağmen, fonksiyonel grup olan karbonil grubunun ana zincirdeki yeri farklıdır. Bu nedenle bu iki bileşik birbirinin konum izomeridir, fonksiyonel grup izomeri değil.",
    "difficulty": 3
  },
  {
    "id": "ai_1764499998125_1",
    "subjectId": "kim",
    "topic": "Organik Kimya",
    "questionText": "Yapı formülü CH3-CH(CH3)-CH(OH)-CH2-CH3 olan bileşiğin IUPAC sistemine göre adı aşağıdakilerden hangisidir?",
    "options": [
      "A) 4-Metil-3-pentanol",
      "B) 2-Metil-3-pentanol",
      "C) 2-Etil-3-bütanol",
      "D) 4-Metil-2-pentanol",
      "E) 3-Hidroksi-2-metil pentan"
    ],
    "correctAnswer": 1,
    "explanation": "IUPAC adlandırması için şu adımlar izlenir: 1. Hidroksil (-OH) grubunu içeren en uzun karbon zinciri seçilir. Bu zincir 5 karbonludur (pentan). 2. Numaralandırmaya -OH grubunun yakın olduğu uçtan başlanır. Sağdan başlandığında -OH 3. karbonda, soldan başlandığında yine 3. karbondadır. 3. Bu eşitlik durumunda, dallanmanın (metil grubu) küçük numarayı alacağı yönden numaralandırma yapılır. Soldan başlanırsa metil grubu 2. karbona, sağdan başlanırsa 4. karbona denk gelir. Bu yüzden soldan numaralandırma tercih edilir. 4. Buna göre, 2. karbonda bir metil grubu ve 3. karbonda bir hidroksil grubu vardır. Bileşiğin adı 2-Metil-3-pentanol olur.",
    "difficulty": 3
  },
  {
    "id": "ai_1764499998125_2",
    "subjectId": "kim",
    "topic": "Organik Kimya",
    "questionText": "2-Metilpropen bileşiğine HBr katılması sonucu oluşan ana ürün aşağıdakilerden hangisidir?",
    "options": [
      "A) 1-Bromo-2-metilpropan",
      "B) 2-Bromo-2-metilpropan",
      "C) 1-Bromobütan",
      "D) 2-Bromobütan",
      "E) 2-Bromo-1-metilpropan"
    ],
    "correctAnswer": 1,
    "explanation": "Bu tepkime, bir alkene asit katılmasıdır ve Markovnikov kuralına göre yürür. Markovnikov kuralı, H-X gibi polar bir molekülün asimetrik bir alkene katılırken, hidrojen atomunun (H+) ikili bağdaki karbonlardan hidrojence zengin olana, X grubunun (Br-) ise hidrojence fakir olana bağlanacağını belirtir. 2-metilpropen [(CH3)2C=CH2] yapısında, ikili bağın C1 karbonunda iki hidrojen, C2 karbonunda ise hiç hidrojen yoktur. Bu nedenle, H+ atomu C1'e bağlanarak -CH3 grubunu oluşturur ve karbokatyon C2'de oluşur. Ardından Br- iyonu bu karbokatyonun bulunduğu C2'ye bağlanır. Sonuç olarak ana ürün 2-Bromo-2-metilpropan'dır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764499998125_3",
    "subjectId": "kim",
    "topic": "Organik Kimya",
    "questionText": "Fenol (C6H5OH) bileşiği ile ilgili aşağıdaki ifadelerden hangisi *yanlıştır*?",
    "options": [
      "A) Zayıf asit özelliği gösterir.",
      "B) NaOH gibi kuvvetli bazlarla tepkimeye girer.",
      "C) Benzen halkasına doğrudan bağlı -OH grubu içerir.",
      "D) Yükseltgenerek benzoik asit oluşturur.",
      "E) Suda çözünürlüğü benzeninkinden fazladır."
    ],
    "correctAnswer": 3,
    "explanation": "A) Fenol, benzen halkasının rezonans etkisiyle -OH grubundaki hidrojeni kolayca iyonlaştırabildiği için zayıf asidik özellik gösterir. Doğru. B) Asidik karakterinden dolayı NaOH gibi kuvvetli bazlarla nötralleşme tepkimesi vererek sodyum fenoksit tuzunu ve suyu oluşturur. Doğru. C) Fenolün tanımı gereği, bir -OH grubu doğrudan benzen halkasına bağlıdır. Doğru. D) Fenol yükseltgenme tepkimeleri verebilir ancak bu tepkimelerle benzoik asit oluşmaz. Benzoik asit, toluenin (metilbenzen) yükseltgenmesiyle elde edilir. Bu ifade yanlıştır. E) Fenol, yapısındaki -OH grubu sayesinde su molekülleriyle hidrojen bağı kurabilir, bu nedenle apolar olan benzene göre suda daha iyi çözünür. Doğru.",
    "difficulty": 3
  },
  {
    "id": "ai_1764499998125_4",
    "subjectId": "kim",
    "topic": "Organik Kimya",
    "questionText": "Aldehitler ve ketonlarla ilgili olarak, aşağıdaki tepkimelerden hangisini sadece aldehitler verirken ketonlar vermez?",
    "options": [
      "A) NaBH4 ile indirgenme",
      "B) Fehling ayıracı ile tepkime",
      "C) HCN ile katılma tepkimesi",
      "D) Grignard bileşikleri ile katılma",
      "E) H2/Ni varlığında hidrojenasyon"
    ],
    "correctAnswer": 1,
    "explanation": "Aldehitler, karbonil karbonuna bağlı bir hidrojen atomu taşıdıkları için kolayca yükseltgenebilirler. Ketonlarda ise karbonil karbonuna iki alkil/aril grubu bağlıdır ve bu nedenle normal koşullarda yükseltgenmezler. Bu özellik, onları ayırt etmek için kullanılır. \n- Fehling ve Tollens ayıraçları zayıf yükseltgenlerdir ve sadece aldehitleri karboksilik asitlere yükseltgerler. Bu sırada Fehling ayıracı kırmızı renkli Cu2O çökeltisi, Tollens ayıracı ise gümüş aynası (Ag) oluşturur. Ketonlar bu ayıraçlarla tepkime vermez.\n- Diğer şıklardaki tepkimeler (indirgenme, HCN katılması, Grignard tepkimesi) hem aldehitlerin hem de ketonların verdiği ortak karbonil grubu tepkimeleridir.",
    "difficulty": 3
  },
  {
    "id": "ai_1764499998125_5",
    "subjectId": "kim",
    "topic": "Organik Kimya",
    "questionText": "2-Bütanol bileşiğinin uygun koşullarda yükseltgenmesi sonucu oluşan ürün ve sülfürik asit katalizörlüğünde ısıtılarak dehidrasyonu (su çekilmesi) sonucu oluşan ana ürün sırasıyla aşağıdakilerden hangisidir?",
    "options": [
      "A) Bütanal, 1-Büten",
      "B) Bütanoik asit, 2-Büten",
      "C) Bütanon, 2-Büten",
      "D) Bütanon, 1-Büten",
      "E) Bütanal, Siklobütan"
    ],
    "correctAnswer": 2,
    "explanation": "1. Yükseltgenme: 2-Bütanol, bir sekonder alkoldür (OH grubunun bağlı olduğu karbon, iki başka karbona bağlıdır). Sekonder alkoller yükseltgendiğinde ketonları oluşturur. 2-Bütanolün yükseltgenmesiyle 2-Bütanon (veya sadece Bütanon) oluşur.\n\n2. Dehidrasyon: Alkollerden asit katalizörlüğünde su çekilmesiyle alkenler oluşur. Bu tepkime Zaitsev kuralına göre yürür. Zaitsev kuralına göre, -OH grubunun ayrıldığı karbona komşu olan karbonlardan hidrojeni az olandan hidrojen ayrılır ve daha kararlı (daha fazla sübstitüe olmuş) alken ana ürün olarak oluşur. 2-Bütanolde, C2'den -OH ayrılır. C1'de 3, C3'te 2 hidrojen vardır. Hidrojeni az olan C3'ten bir hidrojen ayrılmasıyla C2 ve C3 arasında çift bağ oluşur ve ana ürün olarak 2-Büten meydana gelir. (C1'den H ayrılmasıyla oluşan 1-Büten yan üründür).\n\nDolayısıyla, ürünler sırasıyla Bütanon ve 2-Büten'dir.",
    "difficulty": 3
  }
]