[
  {
    "id": "ai_1764500304092_0",
    "subjectId": "tur",
    "topic": "Paragraf",
    "questionText": "Başarısızlık korkusu, pek çok insanın potansiyelini ortaya koymasının önündeki en büyük engeldir. Yeni bir şey denerken hata yapmaktan çekinir, eleştirilmekten korkarız. Oysa öğrenme süreci, deneme yanılma üzerine kuruludur. Tarihteki büyük buluşların ve icatların arkasında sayısız başarısız deneme yatar. Bu yüzden, ----.",
    "options": [
      "her zaman en güvenli yolu tercih etmek gerekir",
      "hataları, hedefe giden yolda birer basamak olarak görmek gerekir",
      "başkalarının tecrübelerinden ders çıkarmak anlamsızdır",
      "başarıya ulaşmak için yetenek tek başına yeterlidir",
      "denemekten vazgeçip uzmanlara danışmak en doğrusudur"
    ],
    "correctAnswer": 1,
    "explanation": "Parçada, başarısızlık korkusunun bir engel olduğu ve öğrenme sürecinin hatalarla dolu olduğu vurgulanmaktadır. Tarihteki büyük buluşların bile başarısız denemeler sonucu ortaya çıktığı belirtilmiştir. Bu nedenle, parçanın sonuna düşüncenin akışına uygun olarak, hatalara olumlu bir anlam yükleyen ve onları öğrenme sürecinin bir parçası olarak gören bir ifade getirilmelidir. 'Hataları, hedefe giden yolda birer basamak olarak görmek gerekir' ifadesi, bu anlamı en iyi şekilde tamamlamaktadır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764500304092_1",
    "subjectId": "tur",
    "topic": "Paragraf",
    "questionText": "(I) Akdeniz mutfağı, zeytinyağı, taze sebzeler ve deniz ürünleri ağırlıklı yapısıyla bilinir. (II) Bu beslenme tarzının sağlık üzerindeki olumlu etkileri bilimsel olarak da kanıtlanmıştır. (III) Özellikle kalp ve damar sağlığını korumada önemli bir rol oynar. (IV) İtalya'nın güney sahilleri, yaz aylarında çok sayıda turist çeker. (V) Yemeklerde baharat ve taze otların kullanımı da lezzeti artıran önemli unsurlardandır.",
    "options": [
      "I",
      "II",
      "III",
      "IV",
      "V"
    ],
    "correctAnswer": 3,
    "explanation": "Parçanın genel konusu Akdeniz mutfağının özellikleri ve sağlığa faydalarıdır. I, II, III ve V numaralı cümleler bu konu etrafında şekillenmektedir. I. cümlede mutfağın temel malzemeleri, II. ve III. cümlelerde sağlıkla ilişkisi, V. cümlede ise lezzet unsurları belirtilmiştir. Ancak IV. cümle, konudan saparak İtalya'daki turizmden bahsetmektedir. Bu cümle, paragrafın genel anlam bütünlüğüne uymadığı için düşüncenin akışını bozmaktadır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764500304092_2",
    "subjectId": "tur",
    "topic": "Paragraf",
    "questionText": "Pek çok insan uykuyu sadece bedensel bir dinlenme olarak görür. Ancak uykunun zihinsel sağlık ve bilişsel işlevler için önemi çok daha derindir. Uyku sırasında beyin, gün içinde öğrenilen bilgileri düzenler, önemli olanları kalıcı hafızaya aktarır ve gereksizleri eler. Bu sürece 'hafıza pekiştirme' denir. Ayrıca, yaratıcı problem çözme yeteneğimizin de yeterli ve kaliteli uykuyla doğrudan ilişkili olduğu kanıtlanmıştır. Kısacası uyku, zihnin kendini yenilediği ve organize ettiği aktif bir süreçtir.",
    "options": [
      "İnsanlar günde ortalama kaç saat uyumalıdır?",
      "Uykusuzluk hangi fiziksel rahatsızlıklara yol açar?",
      "Uykunun zihinsel faaliyetler üzerindeki rolü nedir?",
      "Rüyalar neden ve nasıl görülür?",
      "Farklı yaş gruplarının uyku ihtiyacı değişir mi?"
    ],
    "correctAnswer": 2,
    "explanation": "Paragraf, uykunun sadece bedensel bir dinlenme olmadığını, özellikle zihinsel işlevler için ne kadar önemli olduğunu açıklamaktadır. Metinde uykunun hafızayı güçlendirdiği, bilgileri düzenlediği ve yaratıcı problem çözme yeteneğini artırdığı gibi konulara odaklanılmaktadır. Bu bilgiler, 'Uykunun zihinsel faaliyetler üzerindeki rolü nedir?' sorusuna doğrudan ve kapsamlı bir cevap niteliğindedir. Diğer şıklardaki soruların (uyku süresi, fiziksel rahatsızlıklar, rüyalar, yaş grupları) cevabı paragrafta bulunmamaktadır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764500304092_3",
    "subjectId": "tur",
    "topic": "Paragraf",
    "questionText": "Kitaplar, sessiz öğretmenlerdir. Bize farklı dünyaların kapılarını aralar, hiç gitmediğimiz yerlere götürür, hiç tanımadığımız insanlarla tanıştırırlar. Onların sayfalarında gezinirken hem kelime dağarcığımız zenginleşir hem de empati yeteneğimiz gelişir. Başka bir karakterin gözünden hayata bakmak, kendi düşünce kalıplarımızın dışına çıkmamızı sağlar. Bu sayede olaylara daha geniş bir perspektiften yaklaşmayı öğreniriz.",
    "options": [
      "Kitap okumanın akademik başarıyı garantilediğine",
      "Okumanın yalnızca bir boş zaman aktivitesi olduğuna",
      "Her kitabın okuyucuya aynı deneyimi yaşattığına",
      "Okumanın bireysel gelişim ve anlayış üzerindeki çok yönlü etkilerine",
      "İyi bir okur olmak için çok hızlı okumak gerektiğine"
    ],
    "correctAnswer": 3,
    "explanation": "Parçada kitapların insan üzerindeki çeşitli olumlu etkilerinden bahsedilmektedir. Farklı dünyaları tanıtması, kelime dağarcığını zenginleştirmesi, empatiyi geliştirmesi ve bakış açısını genişletmesi gibi faydaları sıralanmıştır. Bu ifadeler, bir bütün olarak okumanın kişisel gelişim ve dünyaya daha anlayışlı bakma konusundaki çok yönlü katkılarını anlatmaktadır. Dolayısıyla parçada asıl anlatılmak istenen D şıkkında doğru bir şekilde özetlenmiştir.",
    "difficulty": 3
  },
  {
    "id": "ai_1764500304092_4",
    "subjectId": "tur",
    "topic": "Paragraf",
    "questionText": "(I) Dijitalleşme, hayatımızın her alanını derinden etkiliyor. (II) Alışveriş alışkanlıklarımızdan sosyal ilişkilerimize kadar pek çok rutinimiz bu dönüşümden payını aldı. (III) Özellikle Z kuşağı, bu dijital dünyanın içine doğmuş bir nesil olarak öne çıkıyor. (IV) Bu kuşağın teknolojiyle olan ilişkisi, önceki nesillerden oldukça farklı dinamikler barındırıyor. (V) Önceki nesiller ise teknolojiyi sonradan öğrenmek ve ona adapte olmak zorunda kaldı.",
    "options": [
      "II",
      "III",
      "IV",
      "V",
      "Paragraf bölünemez"
    ],
    "correctAnswer": 1,
    "explanation": "Parçanın ilk iki cümlesi (I ve II), dijitalleşmenin genel etkilerinden bahsetmektedir. Konu genel bir çerçevede ele alınmıştır. Ancak III. cümleden itibaren konu özelleşerek 'Z kuşağı' ve nesiller arası teknoloji kullanımı farkına odaklanmaktadır. III, IV ve V. cümleler birbiriyle doğrudan bağlantılı olup Z kuşağı ve önceki nesilleri karşılaştırmaktadır. Bu nedenle, konunun genelden özele geçtiği III. cümle, yeni bir paragrafın başlangıcı olmalıdır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764500304092_5",
    "subjectId": "tur",
    "topic": "Paragraf",
    "questionText": "Minimalizm, en basit tanımıyla 'az ama özdür' felsefesine dayanan bir yaşam biçimi ve sanat akımıdır. Bu akım, nesnelerin ve bilgilerin fazlalığından arınarak sadeliği ve işlevselliği ön plana çıkarır. Örneğin bir minimalist evde, sadece gerçekten ihtiyaç duyulan, bir amaca hizmet eden eşyalar bulunur. Tüketim kültürünün sürekli 'daha fazlasını al' telkininin aksine minimalizm, 'daha azıyla mutlu ol' mesajını verir. Bu yönüyle modern insanın karmaşadan kaçış arayışına bir cevap niteliğindedir.",
    "options": [
      "Öyküleme - Betimleme",
      "Tanımlama - Karşılaştırma",
      "Tartışma - Tanık gösterme",
      "Açıklama - Benzetme",
      "Betimleme - Örnekleme"
    ],
    "correctAnswer": 1,
    "explanation": "Parçanın ilk cümlesi, 'Minimalizm, ... bir yaşam biçimi ve sanat akımıdır.' diyerek doğrudan bir tanım yapmaktadır. Parçanın devamında ise minimalizm, 'Tüketim kültürünün ... aksine' ifadesiyle tüketim kültürüyle karşılaştırılmaktadır. Ayrıca 'örneğin' denilerek örneklemeye de başvurulmuştur. Ancak şıklar arasında hem tanımlama hem de karşılaştırmayı içeren B seçeneği, parçada en ağır basan anlatım tekniklerini bir arada sunmaktadır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764500304092_6",
    "subjectId": "tur",
    "topic": "Paragraf",
    "questionText": "Popüler kültür, hızla üretilip aynı hızla tüketilen bir yapıya sahiptir. Anlık heveslere ve geçici modalara dayanır. Derinlikli bir anlam veya kalıcı bir estetik kaygı taşımaz. Sanat eserleri ise tam tersine, zamana meydan okuyan, evrensel değerler taşıyan ve üzerinden yıllar geçse de güncelliğini yitirmeyen yapıtlardır. Bir popüler şarkı birkaç ayda unutulurken, bir Beethoven bestesi yüzyıllardır dinlenmektedir.",
    "options": [
      "Popüler kültür ürünlerinin sanatsal değer taşımadığına",
      "Sanatın sadece belli bir zümreye hitap ettiğine",
      "Popüler kültür ile sanat arasındaki temel farkın kalıcılık olduğuna",
      "Teknolojinin popüler kültürün yayılmasını hızlandırdığına",
      "Sanatçıların popüler kültüre karşı durması gerektiğine"
    ],
    "correctAnswer": 2,
    "explanation": "Bu paragrafta popüler kültür ile sanat eseri karşılaştırılmaktadır. Popüler kültürün 'hızla tüketilme', 'geçici olma' gibi özelliklerine karşılık, sanat eserlerinin 'zamana meydan okuma', 'kalıcı olma' ve 'yüzyıllardır dinlenme' gibi özellikleri vurgulanmıştır. Bu karşılaştırmanın temel ekseni, kalıcılık ve zamana karşı direnebilmektir. Dolayısıyla, parçadan çıkarılabilecek en temel yargı, ikisi arasındaki asıl farkın kalıcılık olduğudur.",
    "difficulty": 3
  },
  {
    "id": "ai_1764500304092_7",
    "subjectId": "tur",
    "topic": "Paragraf",
    "questionText": "Eleştiri, bir eseri veya sanatçıyı yok etme, küçük düşürme sanatı değildir. Aksine, yapıcı bir eleştiri, eserin daha iyi anlaşılmasına, sanatçının ise kendini geliştirmesine olanak tanır. Objektif ölçütlere dayanan, eserin hem olumlu hem de olumsuz yönlerini ortaya koyan bir değerlendirme, hem okura hem de yazara yol gösterir. Sadece kişisel beğenilere dayanan, övgü ya da yergiden ibaret olan yazılar ise eleştiri değil, olsa olsa birer okur yorumu olabilir.",
    "options": [
      "Eleştirinin amacının yol göstermek ve geliştirmek olduğuna",
      "Her okurun aynı zamanda bir eleştirmen olduğuna",
      "Sanatçıların eleştiriye açık olmaları gerektiğine",
      "Eleştirinin sadece olumsuz yönlere odaklanması gerektiğine",
      "İyi bir eserin eleştiriye ihtiyaç duymadığına"
    ],
    "correctAnswer": 0,
    "explanation": "Paragraf boyunca eleştirinin yıkıcı değil, yapıcı olması gerektiği fikri işlenmiştir. 'Yapıcı bir eleştiri', 'sanatçının kendini geliştirmesine olanak tanır', 'hem okura hem de yazara yol gösterir' gibi ifadeler, eleştirinin temel amacının yok etmek değil, geliştirmek ve yol göstermek olduğunu vurgulamaktadır. Parçanın ana fikri, eleştirinin olumlu ve yapıcı işlevine odaklanmıştır. Bu nedenle doğru cevap A seçeneğidir.",
    "difficulty": 3
  }
]