[
  {
    "id": "ai_1764521016878_0",
    "subjectId": "tur",
    "topic": "Paragraf",
    "questionText": "Aşağıdaki cümlelerden hangisi, verilen paragraftaki ana fikri en iyi şekilde ifade etmektedir?",
    "options": [
      "A) İnsanların doğayla olan ilişkisi karmaşık bir yapıya sahiptir.",
      "B) Doğa, insan yaşamının vazgeçilmez bir parçasıdır.",
      "C) Teknolojik gelişmeler, doğanın korunmasına katkı sağlamaktadır.",
      "D) İnsanlar, doğayı korumak için çeşitli yöntemler geliştirmektedir.",
      "E) Doğa, insanlara sadece kaynak sağlamaktadır."
    ],
    "correctAnswer": 1,
    "explanation": "Paragrafta doğanın insan yaşamındaki önemi vurgulanmakta ve bu ilişki üzerinden ana fikir oluşturulmaktadır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764521016879_1",
    "subjectId": "tur",
    "topic": "Paragraf",
    "questionText": "Verilen paragrafta hangi kavram üzerinde daha fazla durulmamaktadır?",
    "options": [
      "A) Sürdürülebilirlik",
      "B) Ekosistem dengesi",
      "C) İnsan etkisi",
      "D) Tarımsal üretim",
      "E) Doğal kaynaklar"
    ],
    "correctAnswer": 3,
    "explanation": "Paragrafta insan etkisi ve doğal kaynaklar üzerinde durulurken, tarımsal üretim kavramına yeterince yer verilmemiştir.",
    "difficulty": 3
  },
  {
    "id": "ai_1764521016879_2",
    "subjectId": "tur",
    "topic": "Paragraf",
    "questionText": "Paragraftaki bilgilerden hangisi yanlıştır?",
    "options": [
      "A) Hava kirliliği, insan sağlığını olumsuz etkiler.",
      "B) Su kaynaklarının azalması, tarımsal üretimi tehdit eder.",
      "C) Doğal yaşam alanlarının yok olması, biyoçeşitliliği artırır.",
      "D) Enerji tüketiminin azaltılması, çevre dostu bir yaklaşım olarak görülmektedir.",
      "E) Atık yönetimi, doğal kaynakların korunmasında önemlidir."
    ],
    "correctAnswer": 2,
    "explanation": "Doğal yaşam alanlarının yok olması biyoçeşitliliği artırmaz, aksine azaltır. Bu, paragraftaki yanlış bilgidir.",
    "difficulty": 3
  }
]