[
  {
    "id": "ai_1764498174752_0",
    "subjectId": "mat",
    "topic": "Permütasyon ve Kombinasyon",
    "questionText": "Aralarında 5 doktor ve 4 hemşirenin bulunduğu bir gruptan, en az 2'si doktor olmak şartıyla 3 kişilik bir sağlık ekibi kaç farklı şekilde oluşturulabilir?",
    "options": [
      "40",
      "44",
      "50",
      "70",
      "84"
    ],
    "correctAnswer": 2,
    "explanation": "Bu soruyu çözmek için iki durumu ele almalıyız, çünkü ekipte en az 2 doktor olması isteniyor. Toplam ekip 3 kişilik olacak.\n\nDurum 1: Ekipte tam olarak 2 doktor ve 1 hemşire bulunur.\n5 doktordan 2'si seçilir: C(5, 2) = (5 * 4) / (2 * 1) = 10\n4 hemşireden 1'i seçilir: C(4, 1) = 4\nBu durum için oluşturulabilecek ekip sayısı: 10 * 4 = 40\n\nDurum 2: Ekipte tam olarak 3 doktor ve 0 hemşire bulunur.\n5 doktordan 3'ü seçilir: C(5, 3) = C(5, 2) = (5 * 4) / (2 * 1) = 10\n4 hemşireden 0'ı seçilir: C(4, 0) = 1\nBu durum için oluşturulabilecek ekip sayısı: 10 * 1 = 10\n\nToplam farklı ekip sayısı, bu iki durumun toplamıdır:\nToplam = 40 + 10 = 50.\nBu nedenle, en az 2'si doktor olan 3 kişilik bir sağlık ekibi 50 farklı şekilde oluşturulabilir.",
    "difficulty": 3
  },
  {
    "id": "ai_1764498174752_1",
    "subjectId": "mat",
    "topic": "Permütasyon ve Kombinasyon",
    "questionText": "\"MATEMATİK\" kelimesinin harflerinin yerleri değiştirilerek yazılabilecek 9 harfli anlamlı ya da anlamsız kelimelerin kaç tanesinde tüm sesli harfler (A, E, A, İ) yan yana bulunur?",
    "options": [
      "180",
      "360",
      "1080",
      "2160",
      "4320"
    ],
    "correctAnswer": 3,
    "explanation": "Bu tür sorularda yan yana olması istenen elemanları tek bir blok olarak kabul ederiz.\n\n1. Harfleri ayıralım:\nSesli harfler: A, E, A, İ (Toplam 4 adet, 2 tanesi A tekrar ediyor)\nSessiz harfler: M, T, M, T, K (Toplam 5 adet, M ve T ikişer kez tekrar ediyor)\n\n2. Sesli harfleri tek bir blok olarak düşünelim:\n(AEAI) bloğunu 'X' olarak isimlendirelim. Artık sıralamamız gereken elemanlar: X, M, T, M, T, K. Bu, toplam 6 elemandır.\n\n3. Bu 6 elemanın sıralamasını bulalım (Tekrarlı Permütasyon):\nElimizde 6 eleman var, ancak M harfi 2 kez, T harfi 2 kez tekrar ediyor.\nSıralama sayısı = 6! / (2! * 2!) = 720 / (2 * 2) = 720 / 4 = 180.\n\n4. Sesli harflerin kendi içindeki sıralamasını bulalım:\n'X' bloğunun içindeki A, E, A, İ harflerinin kendi aralarındaki sıralamasını bulmalıyız. Bu 4 harften A harfi 2 kez tekrar ediyor.\nKendi içlerindeki sıralama sayısı = 4! / 2! = 24 / 2 = 12.\n\n5. Toplam sıralama sayısını bulalım:\nÇarpma kuralına göre, blokların sıralanma sayısı ile blok içindeki elemanların sıralanma sayısını çarparız.\nToplam farklı kelime sayısı = 180 * 12 = 2160.\nBu nedenle, sesli harflerin yan yana olduğu 2160 farklı kelime yazılabilir.",
    "difficulty": 3
  }
]