[
  {
    "id": "ai_1764500179499_0",
    "subjectId": "biy",
    "topic": "Sinir Sistemi",
    "questionText": "Bir nöronda miyelin kılıf bulunması, impuls iletimi sırasında aşağıdaki olaylardan hangisine neden olmaz?",
    "options": [
      "İmpuls iletim hızının artması",
      "Sodyum-potasyum pompasının daha az çalışması nedeniyle enerji tasarrufu sağlanması",
      "Aksiyon potansiyelinin sadece Ranvier boğumlarında oluşması",
      "Uyartının şiddetinin akson boyunca artarak ilerlemesi",
      "İmpulsun bir boğumdan diğerine atlayarak iletilmesi (saltatorik iletim)"
    ],
    "correctAnswer": 3,
    "explanation": "Sinir hücrelerinde impuls iletimi \"hep ya da hiç\" prensibine göre çalışır. Bu prensibe göre, bir nöron eşik değerde veya üzerinde bir uyarı aldığında her zaman aynı şiddette ve hızda bir aksiyon potansiyeli oluşturur. Uyartının şiddeti, impulsun şiddetini (amplitüdünü) değil, sıklığını (frekansını) etkiler. Miyelin kılıf, impulsun Ranvier boğumlarında atlayarak (saltatorik) iletilmesini sağlar, bu da hızı artırır ve sadece boğumlarda iyon değişimi olduğu için enerji tasarrufu sağlar. Ancak miyelin kılıf, impulsun şiddetini akson boyunca artırmaz, şiddet sabit kalır.",
    "difficulty": 3
  },
  {
    "id": "ai_1764500179499_1",
    "subjectId": "biy",
    "topic": "Sinir Sistemi",
    "questionText": "Bir kaza sonucu beyinciği hasar gören bir bireyde, aşağıdaki durumlardan hangisinin gözlenmesi en olasıdır?",
    "options": [
      "Solunum ve dolaşım gibi hayati faaliyetlerin durması",
      "Hafıza kaybı ve öğrenme güçlüğü yaşanması",
      "Vücut sıcaklığı ve kan basıncının düzenlenememesi",
      "Refleks hareketlerinin kontrol edilememesi",
      "Denge kaybı ve hareketlerde koordinasyon bozukluğu yaşanması"
    ],
    "correctAnswer": 4,
    "explanation": "Beyincik (serebellum), vücudun temel denge ve hareket koordinasyon merkezidir. Göz, kulak ve kaslardan gelen bilgileri işleyerek istemli kas hareketlerinin düzenli ve uyumlu bir şekilde yapılmasını sağlar. Bu nedenle beyinciği hasar gören bir kişide en belirgin sorunlar denge kaybı, yürümede zorluk ve hareketlerde (örneğin bir nesneyi tutmaya çalışırken) koordinasyon bozukluğu olacaktır. Diğer şıklardaki işlevler ise farklı beyin bölgeleri tarafından kontrol edilir: A) Omurilik soğanı, B) Uç beyin (serebral korteks), C) Hipotalamus, D) Omurilik.",
    "difficulty": 3
  }
]