[
  {
    "id": "ai_1764501455383_0",
    "subjectId": "biy",
    "topic": "Sinir Sistemi",
    "questionText": "Miyelin kılıfı hasar görmüş bir nöronda, impuls iletimiyle ilgili olarak aşağıdaki değişikliklerden hangisinin meydana gelmesi beklenir?",
    "options": [
      "Aksiyon potansiyelinin şiddetinin artması",
      "İmpuls iletim hızının artması",
      "İmpuls iletimi için harcanan ATP miktarının artması",
      "Uyarılma için gerekli eşik değerinin düşmesi",
      "Repolarizasyon süresinin kısalması"
    ],
    "correctAnswer": 2,
    "explanation": "Miyelin kılıf, akson üzerinde bir yalıtım tabakası oluşturarak impulsun sadece Ranvier boğumlarında oluşmasını sağlar. Bu duruma 'atlamalı iletim' denir. Atlamalı iletim, hem impulsun çok daha hızlı ilerlemesini hem de sadece boğumlarda iyon değişimi olduğu için enerji (ATP) tasarrufu sağlar. Miyelin kılıf hasar gördüğünde, atlamalı iletim ortadan kalkar ve impuls akson boyunca her noktada yeniden oluşturulmak zorunda kalır. Bu durum, sodyum-potasyum pompasının çok daha fazla çalışmasına ve dolayısıyla harcanan ATP miktarının önemli ölçüde artmasına neden olur. Ayrıca impuls iletim hızı da yavaşlar. Aksiyon potansiyelinin şiddeti ve eşik değer ise 'hep ya da hiç' prensibi gereği değişmez.",
    "difficulty": 3
  },
  {
    "id": "ai_1764501455383_1",
    "subjectId": "biy",
    "topic": "Sinir Sistemi",
    "questionText": "Bir kaza sonucu beynin sadece beyincik (serebellum) bölgesi hasar gören bir bireyde, aşağıdaki durumlardan hangisinin gözlenmesi en olasıdır?",
    "options": [
      "Hafıza kaybı ve yeni bilgileri öğrenmede güçlük",
      "Solunum ve dolaşım gibi hayati fonksiyonların durması",
      "Acı ve sıcaklık gibi duyuların algılanamaması",
      "İki elini kullanarak düz bir çizgi üzerinde yürümede zorlanma",
      "Konuşulanları anlama fakat konuşarak cevap verememe"
    ],
    "correctAnswer": 3,
    "explanation": "Beyincik (serebellum), vücudun temel denge ve hareket koordinasyon merkezidir. İstemli kas hareketlerinin düzenli ve uyumlu bir şekilde çalışmasını sağlar. Beyincik hasar gördüğünde, kişi hareketlerini koordine etmekte zorlanır, denge sorunları yaşar ve yürüme gibi karmaşık motor becerilerde bozulmalar görülür. Diğer şıklar ise beynin farklı bölgeleriyle ilgilidir: A) Hafıza ve öğrenme (Hipokampus ve serebral korteks), B) Hayati fonksiyonlar (Omurilik soğanı - Beyin sapı), C) Duyu algısı (Talamus ve serebral korteks), E) Konuşma (Broca ve Wernicke alanları - Serebral korteks).",
    "difficulty": 3
  }
]