[
  {
    "id": "ai_1764498792328_0",
    "subjectId": "biy",
    "topic": "Sinir Sistemi",
    "questionText": "Aksiyon potansiyelinin repolarizasyon evresinde, zar potansiyelinin tekrar negatif değerlere dönmesinden temel olarak sorumlu olan iyon hareketi aşağıdakilerden hangisidir?",
    "options": [
      "Na+ iyonlarının hücre içine girmesi (influks)",
      "K+ iyonlarının hücre dışına çıkması (efluks)",
      "Ca2+ iyonlarının hücre içine girmesi (influks)",
      "Voltaj kapılı Na+ kanallarının aktifleşmesi",
      "Cl- iyonlarının hücre içine girmesi (influks)"
    ],
    "correctAnswer": 1,
    "explanation": "Repolarizasyon, hücre zarının yeniden kutuplaşarak dinlenme potansiyeline dönmesidir. Bu evrede, voltaj kapılı Na+ kanalları inaktif duruma geçerken, voltaj kapılı K+ kanalları açılır. Bu durum, K+ iyonlarının derişim gradyanına uygun olarak hücre dışına çıkmasına (efluks) neden olur. Pozitif yüklü iyonların (K+) hücre dışına çıkması, hücre içinin tekrar negatif hale gelmesini sağlar ve zar potansiyelini dinlenme potansiyeline yaklaştırır. Na+ girişi depolarizasyonda, Ca2+ girişi ise genellikle sinaptik iletimde rol oynar.",
    "difficulty": 3
  },
  {
    "id": "ai_1764498792328_1",
    "subjectId": "biy",
    "topic": "Sinir Sistemi",
    "questionText": "Alkolün etkisi altındayken bir kişinin denge kurmakta zorlanması, yürümede güçlük çekmesi ve hareketlerini koordine edememesi, alkolün öncelikli olarak beynin hangi bölümünü etkilediğini gösterir?",
    "options": [
      "Omurilik soğanı",
      "Uç beyin (Serebrum)",
      "Hipotalamus",
      "Talamus",
      "Beyincik (Serebellum)"
    ],
    "correctAnswer": 4,
    "explanation": "Beyincik (serebellum), vücudun denge ve hareket koordinasyon merkezidir. İstemli kas hareketlerinin düzenli ve uyumlu bir şekilde gerçekleşmesini sağlar. Alkol, beyinciğin fonksiyonlarını baskılayarak denge kaybı, yürüme bozuklukları (ataksi) ve ince motor becerilerinde bozulma gibi semptomlara yol açar. Soruda tarif edilen belirtiler, doğrudan beyinciğin görevleriyle ilgilidir. Diğer şıklar ise farklı fonksiyonlardan sorumludur (Omurilik soğanı: Hayati refleksler, Hipotalamus: Homeostazi, Talamus: Duyu merkezi, Uç beyin: İstemli hareketler ve bilinç).",
    "difficulty": 3
  },
  {
    "id": "ai_1764498792328_2",
    "subjectId": "biy",
    "topic": "Sinir Sistemi",
    "questionText": "Bir nöronda impuls iletim hızı, aşağıdaki faktörlerden hangisine bağlı olarak **değişmez**?",
    "options": [
      "Miyelin kılıfın varlığı",
      "Akson çapının genişliği",
      "Ranvier boğum sayısı",
      "Uyarının şiddeti",
      "Sıcaklık"
    ],
    "correctAnswer": 3,
    "explanation": "Nöronlarda impuls iletimi \"ya hep ya hiç\" prensibine göre çalışır. Bu prensibe göre, bir nöronun uyarılabilmesi için uyarının en azından eşik değerde olması gerekir. Uyarı eşik değeri aştıktan sonra, şiddetinin daha da artması aksiyon potansiyelinin hızını veya büyüklüğünü değiştirmez; sadece birim zamandaki impuls sayısını (frekansını) artırır. Miyelin kılıf varlığı ve akson çapının artması hızı artırır. Ranvier boğum sayısı ve sıcaklık gibi faktörler de iletim hızını etkiler. Ancak uyarının şiddeti, eşik değer aşıldıktan sonra hızı etkilemez.",
    "difficulty": 3
  }
]