[
  {
    "id": "ai_1764500220717_0",
    "subjectId": "biy",
    "topic": "Solunum Sistemi",
    "questionText": "İnsanlarda normal bir soluk alma (inspirasyon) süreciyle ilgili aşağıdaki ifadelerden hangisi yanlıştır?",
    "options": [
      "Diyafram kası kasılarak düzleşir.",
      "Kaburgalar arası kaslar kasılarak göğüs kafesini yukarı ve öne doğru hareket ettirir.",
      "Göğüs boşluğunun hacmi artar, iç basıncı düşer.",
      "Akciğerler genişler ve akciğer iç basıncı atmosfer basıncının altına düşer.",
      "Karın boşluğunun hacmi artar ve karın iç basıncı düşer."
    ],
    "correctAnswer": 4,
    "explanation": "Soluk alma sırasında diyafram kası kasılarak aşağı doğru hareket eder ve düzleşir. Bu durum, üstteki göğüs boşluğunun hacmini artırırken, alttaki karın boşluğunu sıkıştırır. Dolayısıyla karın boşluğunun hacmi azalır ve karın iç basıncı artar. Diğer şıklardaki olaylar ise soluk alma sırasında doğru bir şekilde gerçekleşir: Kaburgalar arası kasların kasılması ve diyaframın düzleşmesi göğüs boşluğu hacmini artırır. Hacim artışıyla düşen basınç (akciğer iç basıncı < atmosfer basıncı), havanın akciğerlere dolmasını sağlar.",
    "difficulty": 3
  },
  {
    "id": "ai_1764500220717_1",
    "subjectId": "biy",
    "topic": "Solunum Sistemi",
    "questionText": "Aşağıdakilerden hangisi, kan ile doku hücreleri arasında gerçekleşen gaz alışverişi sırasında karbondioksitin taşınma yollarından biri değildir?",
    "options": [
      "Kan plazmasında çözünmüş olarak taşınması",
      "Alyuvarlarda hemoglobine bağlanarak karbaminohemoglobin şeklinde taşınması",
      "Alyuvarlarda karbonik anhidraz enzimiyle su ile birleştirilip plazmaya oksihemoglobin olarak verilmesi",
      "Kan plazmasında bikarbonat (HCO₃⁻) iyonları şeklinde taşınması",
      "Alyuvarların sitoplazmasında bikarbonat iyonlarına dönüştürülmesi"
    ],
    "correctAnswer": 2,
    "explanation": "Karbondioksitin kanda taşınmasının üç temel yolu vardır: 1) Çok küçük bir kısmı (%7) kan plazmasında çözünmüş halde. 2) Bir kısmı (%23) alyuvarlarda hemoglobine bağlanarak karbaminohemoglobin (HbCO₂) şeklinde. 3) En büyük kısmı (%70) ise alyuvarlarda karbonik anhidraz enzimi sayesinde su ile birleşerek karbonik aside (H₂CO₃) dönüşür, bu asit de bikarbonat (HCO₃⁻) ve H⁺ iyonlarına ayrışır. Oluşan bikarbonat iyonları plazmaya geçerek taşınır. C şıkkında belirtilen \"oksihemoglobin\" ise hemoglobinin oksijen bağlamış halidir ve oksijenin taşınmasıyla ilgilidir, karbondioksit taşınmasıyla doğrudan bir ilişkisi bu şekilde yoktur. Bu nedenle C şıkkı yanlıştır.",
    "difficulty": 3
  }
]