[
  {
    "id": "ai_1764498848935_0",
    "subjectId": "biy",
    "topic": "Solunum Sistemi",
    "questionText": "Sağlıklı bir insanda, doku kılcallarından geçmekte olan kanda oksijenin hemoglobinden ayrılma eğiliminin artmasında aşağıdakilerden hangisi etkili olmaz?",
    "options": [
      "Kan pH değerinin düşmesi",
      "Kandaki karbondioksit kısmi basıncının artması",
      "Vücut sıcaklığının artması",
      "Alveollerdeki oksijen kısmi basıncının yüksek olması",
      "Kanda laktik asit miktarının artması"
    ],
    "correctAnswer": 3,
    "explanation": "Hemoglobinin oksijeni bağlama veya serbest bırakma eğilimi çeşitli faktörlere bağlıdır. Bu duruma Bohr etkisi denir. Doku kılcallarında hücresel solunum sonucu CO2 artar. CO2'nin artması kan pH'sını düşürür (asitliği artırır). Ayrıca egzersiz gibi durumlarda vücut sıcaklığı ve laktik asit miktarı artar. Bu üç faktör (düşük pH, yüksek CO2, yüksek sıcaklık) hemoglobinin oksijene olan ilgisini azaltır ve oksijenin dokulara daha kolay bırakılmasını sağlar. Ancak, alveollerdeki oksijen kısmi basıncının yüksek olması, oksijenin hemoglobinden ayrılmasını değil, tam tersine hemoglobine bağlanmasını kolaylaştıran bir faktördür. Bu olay akciğer kılcallarında gerçekleşir.",
    "difficulty": 3
  },
  {
    "id": "ai_1764498848935_1",
    "subjectId": "biy",
    "topic": "Solunum Sistemi",
    "questionText": "İnsanda soluk verme (ekspirasyon) sırasında aşağıdaki olaylardan hangisi gerçekleşir?",
    "options": [
      "Diyafram kası kasılarak düzleşir.",
      "Kaburgalar arası kaslar kasılarak göğüs kafesini yukarı ve dışa doğru hareket ettirir.",
      "Göğüs boşluğunun hacmi artar.",
      "Akciğerlerin iç basıncı atmosfer basıncının altına düşer.",
      "Göğüs boşluğunun hacminin azalmasıyla akciğerler sıkışır ve iç basınç artar."
    ],
    "correctAnswer": 4,
    "explanation": "Soluk verme, genellikle pasif bir olaydır. Bu sırada soluk almada kasılan kaslar gevşer. Diyafram kası gevşeyerek kubbeleşir. Kaburgalar arası kaslar gevşer ve göğüs kafesi aşağı ve içe doğru hareket eder. Bu iki olay sonucunda göğüs boşluğunun hacmi azalır. Göğüs boşluğu hacminin azalması, akciğerlerin sıkışmasına ve akciğer içindeki havanın basıncının atmosfer basıncından daha yüksek bir seviyeye çıkmasına neden olur. Bu basınç farkı, havanın akciğerlerden dışarı çıkmasını sağlar. Diğer şıklardaki olaylar (A, B, C) soluk alma (inspirasyon) sırasında gerçekleşir. D şıkkı da soluk alma sırasında gerçekleşen bir durumdur.",
    "difficulty": 3
  },
  {
    "id": "ai_1764498848935_2",
    "subjectId": "biy",
    "topic": "Solunum Sistemi",
    "questionText": "Kanda karbondioksit taşınması ile ilgili aşağıdaki ifadelerden hangisi yanlıştır?",
    "options": [
      "Karbondioksitin büyük bir bölümü, alyuvarlarda karbonik anhidraz enzimi aracılığıyla bikarbonat iyonlarına dönüştürülerek kan plazmasında taşınır.",
      "Alyuvarlarda oluşan bikarbonat iyonları, klor iyonları ile yer değiştirerek plazmaya geçer.",
      "Karbondioksitin bir kısmı doğrudan hemoglobinin amino grubuna bağlanarak karbominohemoglobin şeklinde taşınır.",
      "Kan plazmasında çözünmüş halde de bir miktar karbondioksit taşınır.",
      "Karbonik anhidraz enzimi hem doku kılcallarında hem de akciğer kılcallarında sadece tek yönlü reaksiyon gerçekleştirir."
    ],
    "correctAnswer": 4,
    "explanation": "Karbondioksit kanda üç şekilde taşınır: 1) Kan plazmasında çözünmüş halde (en az), 2) Hemoglobine bağlanarak (karbominohemoglobin), 3) Bikarbonat iyonları (HCO3-) şeklinde (en fazla). Doku kılcallarında, CO2 alyuvarlara girer ve karbonik anhidraz enzimi ile suyla birleşerek karbonik asit (H2CO3) oluşturur. Karbonik asit daha sonra H+ ve bikarbonat (HCO3-) iyonlarına ayrışır. HCO3-, \"klor kayması\" adı verilen bir olayla plazmaya çıkar. Akciğer kılcallarında ise bu reaksiyonlar tersine işler. Plazmadaki HCO3- tekrar alyuvara girer, H+ ile birleşerek H2CO3'ü oluşturur ve aynı karbonik anhidraz enzimi bu sefer H2CO3'ü CO2 ve H2O'ya parçalar. Dolayısıyla karbonik anhidraz enzimi çift yönlü (tersinir) çalışan bir enzimdir. Bu nedenle E şıkkı yanlıştır.",
    "difficulty": 3
  }
]